zephyrproject-rtos/hal_nuvoton/dts/pinctrl/m55m1h2l-pinctrl.h
/*
 * Copyright (c) 2025 Nuvoton Technology Corporation.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include "../m55m1x/sys_reg.h"
#include "../m55m1x/sys.h"

#define NVT_PINMUX(port, pinIndex, mfp) \
    ((((port) - 'A') << 28) | \
    ((pinIndex) << 24) | \
    ((mfp) >> ((pinIndex % 4) * 8)))

#define PA0MFP_GPIO                  NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_GPIO)
#define PA0MFP_QSPI0_MOSI0           NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_QSPI0_MOSI0)
#define PA0MFP_SPI0_MOSI             NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_SPI0_MOSI)
#define PA0MFP_SD1_DAT0              NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_SD1_DAT0)
#define PA0MFP_SC0_CLK               NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_SC0_CLK)
#define PA0MFP_UART0_RXD             NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_UART0_RXD)
#define PA0MFP_UART1_nRTS            NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_UART1_nRTS)
#define PA0MFP_I2C2_SDA              NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_I2C2_SDA)
#define PA0MFP_CCAP_DATA6            NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_CCAP_DATA6)
#define PA0MFP_I3C0_SDA              NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_I3C0_SDA)
#define PA0MFP_BPWM0_CH0             NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_BPWM0_CH0)
#define PA0MFP_EPWM0_CH5             NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_EPWM0_CH5)
#define PA0MFP_EQEI3_B               NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_EQEI3_B)
#define PA0MFP_DAC0_ST               NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_DAC0_ST)
#define PA0MFP_PSIO0_CH7             NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_PSIO0_CH7)
#define PA0MFP_UTCPD0_VCNEN1         NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_UTCPD0_VCNEN1)
#define PA0MFP_LPSPI0_MOSI           NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_LPSPI0_MOSI)
#define PA0MFP_LPUART0_RXD           NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_LPUART0_RXD)
#define PA0MFP_LPIO0                 NVT_PINMUX('A', 0, SYS_GPA_MFP0_PA0MFP_LPIO0)
#define PA1MFP_GPIO                  NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_GPIO)
#define PA1MFP_QSPI0_MISO0           NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_QSPI0_MISO0)
#define PA1MFP_SPI0_MISO             NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_SPI0_MISO)
#define PA1MFP_SD1_DAT1              NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_SD1_DAT1)
#define PA1MFP_SC0_DAT               NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_SC0_DAT)
#define PA1MFP_UART0_TXD             NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_UART0_TXD)
#define PA1MFP_UART1_nCTS            NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_UART1_nCTS)
#define PA1MFP_I2C2_SCL              NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_I2C2_SCL)
#define PA1MFP_CCAP_DATA7            NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_CCAP_DATA7)
#define PA1MFP_I3C0_SCL              NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_I3C0_SCL)
#define PA1MFP_BPWM0_CH1             NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_BPWM0_CH1)
#define PA1MFP_EPWM0_CH4             NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_EPWM0_CH4)
#define PA1MFP_EQEI3_A               NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_EQEI3_A)
#define PA1MFP_DAC1_ST               NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_DAC1_ST)
#define PA1MFP_DMIC1_CLK             NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_DMIC1_CLK)
#define PA1MFP_PSIO0_CH6             NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_PSIO0_CH6)
#define PA1MFP_UTCPD0_DISCHG         NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_UTCPD0_DISCHG)
#define PA1MFP_UTCPD0_FRSTX1         NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_UTCPD0_FRSTX1)
#define PA1MFP_LPSPI0_MISO           NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_LPSPI0_MISO)
#define PA1MFP_LPUART0_TXD           NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_LPUART0_TXD)
#define PA1MFP_LPIO1                 NVT_PINMUX('A', 1, SYS_GPA_MFP0_PA1MFP_LPIO1)
#define PA2MFP_GPIO                  NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_GPIO)
#define PA2MFP_QSPI0_CLK             NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_QSPI0_CLK)
#define PA2MFP_SPI0_CLK              NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_SPI0_CLK)
#define PA2MFP_SD1_DAT2              NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_SD1_DAT2)
#define PA2MFP_SC0_RST               NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_SC0_RST)
#define PA2MFP_UART4_RXD             NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_UART4_RXD)
#define PA2MFP_UART1_RXD             NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_UART1_RXD)
#define PA2MFP_I2C1_SDA              NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_I2C1_SDA)
#define PA2MFP_I2C0_SMBSUS           NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_I2C0_SMBSUS)
#define PA2MFP_CCAP_DATA2            NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_CCAP_DATA2)
#define PA2MFP_BPWM0_CH2             NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_BPWM0_CH2)
#define PA2MFP_EPWM0_CH3             NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_EPWM0_CH3)
#define PA2MFP_EQEI3_INDEX           NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_EQEI3_INDEX)
#define PA2MFP_DMIC1_DAT             NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_DMIC1_DAT)
#define PA2MFP_PSIO0_CH5             NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_PSIO0_CH5)
#define PA2MFP_I3C0_PUPEN            NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_I3C0_PUPEN)
#define PA2MFP_UTCPD0_VBSRCEN        NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_UTCPD0_VBSRCEN)
#define PA2MFP_LPSPI0_CLK            NVT_PINMUX('A', 2, SYS_GPA_MFP0_PA2MFP_LPSPI0_CLK)
#define PA3MFP_GPIO                  NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_GPIO)
#define PA3MFP_QSPI0_SS              NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_QSPI0_SS)
#define PA3MFP_SPI0_SS               NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_SPI0_SS)
#define PA3MFP_SD1_DAT3              NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_SD1_DAT3)
#define PA3MFP_SC0_PWR               NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_SC0_PWR)
#define PA3MFP_UART4_TXD             NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_UART4_TXD)
#define PA3MFP_UART1_TXD             NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_UART1_TXD)
#define PA3MFP_I2C1_SCL              NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_I2C1_SCL)
#define PA3MFP_I2C0_SMBAL            NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_I2C0_SMBAL)
#define PA3MFP_CCAP_DATA3            NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_CCAP_DATA3)
#define PA3MFP_BPWM0_CH3             NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_BPWM0_CH3)
#define PA3MFP_EPWM0_CH2             NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_EPWM0_CH2)
#define PA3MFP_EQEI0_B               NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_EQEI0_B)
#define PA3MFP_EPWM1_BRAKE1          NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_EPWM1_BRAKE1)
#define PA3MFP_DMIC0_CLKLP           NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_DMIC0_CLKLP)
#define PA3MFP_PSIO0_CH4             NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_PSIO0_CH4)
#define PA3MFP_UTCPD0_VBSNKEN        NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_UTCPD0_VBSNKEN)
#define PA3MFP_LPSPI0_SS             NVT_PINMUX('A', 3, SYS_GPA_MFP0_PA3MFP_LPSPI0_SS)
#define PA4MFP_GPIO                  NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_GPIO)
#define PA4MFP_EBI_AD1               NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_EBI_AD1)
#define PA4MFP_QSPI0_MOSI1           NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_QSPI0_MOSI1)
#define PA4MFP_SPI0_I2SMCLK          NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_SPI0_I2SMCLK)
#define PA4MFP_SD1_CLK               NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_SD1_CLK)
#define PA4MFP_SC0_nCD               NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_SC0_nCD)
#define PA4MFP_UART0_nRTS            NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_UART0_nRTS)
#define PA4MFP_UART5_RXD             NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_UART5_RXD)
#define PA4MFP_I2C0_SDA              NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_I2C0_SDA)
#define PA4MFP_CANFD0_RXD            NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_CANFD0_RXD)
#define PA4MFP_UART0_RXD             NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_UART0_RXD)
#define PA4MFP_BPWM0_CH4             NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_BPWM0_CH4)
#define PA4MFP_EPWM0_CH1             NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_EPWM0_CH1)
#define PA4MFP_EQEI0_A               NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_EQEI0_A)
#define PA4MFP_CCAP_SCLK             NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_CCAP_SCLK)
#define PA4MFP_DMIC0_CLK             NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_DMIC0_CLK)
#define PA4MFP_I3C0_SDA              NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_I3C0_SDA)
#define PA4MFP_UTCPD0_VBSRCEN        NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_UTCPD0_VBSRCEN)
#define PA4MFP_LPUART0_RXD           NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_LPUART0_RXD)
#define PA4MFP_LPUART0_nRTS          NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_LPUART0_nRTS)
#define PA4MFP_LPI2C0_SDA            NVT_PINMUX('A', 4, SYS_GPA_MFP1_PA4MFP_LPI2C0_SDA)
#define PA5MFP_GPIO                  NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_GPIO)
#define PA5MFP_EBI_AD0               NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_EBI_AD0)
#define PA5MFP_QSPI0_MISO1           NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_QSPI0_MISO1)
#define PA5MFP_SPI1_I2SMCLK          NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_SPI1_I2SMCLK)
#define PA5MFP_SD1_CMD               NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_SD1_CMD)
#define PA5MFP_SC2_nCD               NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_SC2_nCD)
#define PA5MFP_UART0_nCTS            NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_UART0_nCTS)
#define PA5MFP_UART5_TXD             NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_UART5_TXD)
#define PA5MFP_I2C0_SCL              NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_I2C0_SCL)
#define PA5MFP_CANFD0_TXD            NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_CANFD0_TXD)
#define PA5MFP_UART0_TXD             NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_UART0_TXD)
#define PA5MFP_BPWM0_CH5             NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_BPWM0_CH5)
#define PA5MFP_EPWM0_CH0             NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_EPWM0_CH0)
#define PA5MFP_EQEI0_INDEX           NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_EQEI0_INDEX)
#define PA5MFP_CCAP_PIXCLK           NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_CCAP_PIXCLK)
#define PA5MFP_DMIC0_DAT             NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_DMIC0_DAT)
#define PA5MFP_I3C0_SCL              NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_I3C0_SCL)
#define PA5MFP_UTCPD0_VBSNKEN        NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_UTCPD0_VBSNKEN)
#define PA5MFP_LPUART0_TXD           NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_LPUART0_TXD)
#define PA5MFP_LPUART0_nCTS          NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_LPUART0_nCTS)
#define PA5MFP_LPI2C0_SCL            NVT_PINMUX('A', 5, SYS_GPA_MFP1_PA5MFP_LPI2C0_SCL)
#define PA6MFP_GPIO                  NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_GPIO)
#define PA6MFP_UTCPD0_DISCHG         NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_UTCPD0_DISCHG)
#define PA6MFP_EMAC0_RMII_RXERR      NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_EMAC0_RMII_RXERR)
#define PA6MFP_SPI1_SS               NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_SPI1_SS)
#define PA6MFP_SD1_nCD               NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_SD1_nCD)
#define PA6MFP_SC2_CLK               NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_SC2_CLK)
#define PA6MFP_UART0_RXD             NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_UART0_RXD)
#define PA6MFP_I2C1_SDA              NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_I2C1_SDA)
#define PA6MFP_QSPI1_MOSI1           NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_QSPI1_MOSI1)
#define PA6MFP_EPWM1_CH5             NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_EPWM1_CH5)
#define PA6MFP_BPWM1_CH3             NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_BPWM1_CH3)
#define PA6MFP_ACMP1_WLAT            NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_ACMP1_WLAT)
#define PA6MFP_TM3                   NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_TM3)
#define PA6MFP_INT0                  NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_INT0)
#define PA6MFP_UTCPD0_VBSRCEN        NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_UTCPD0_VBSRCEN)
#define PA6MFP_KPI_COL0              NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_KPI_COL0)
#define PA6MFP_LPUART0_RXD           NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_LPUART0_RXD)
#define PA6MFP_LPIO4                 NVT_PINMUX('A', 6, SYS_GPA_MFP1_PA6MFP_LPIO4)
#define PA7MFP_GPIO                  NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_GPIO)
#define PA7MFP_EBI_AD7               NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_EBI_AD7)
#define PA7MFP_EMAC0_RMII_CRSDV      NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_EMAC0_RMII_CRSDV)
#define PA7MFP_SPI1_CLK              NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_SPI1_CLK)
#define PA7MFP_SC2_DAT               NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_SC2_DAT)
#define PA7MFP_UART0_TXD             NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_UART0_TXD)
#define PA7MFP_I2C1_SCL              NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_I2C1_SCL)
#define PA7MFP_QSPI1_MISO1           NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_QSPI1_MISO1)
#define PA7MFP_EPWM1_CH4             NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_EPWM1_CH4)
#define PA7MFP_BPWM1_CH2             NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_BPWM1_CH2)
#define PA7MFP_ACMP0_WLAT            NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_ACMP0_WLAT)
#define PA7MFP_TM2                   NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_TM2)
#define PA7MFP_INT1                  NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_INT1)
#define PA7MFP_UTCPD0_VBSNKEN        NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_UTCPD0_VBSNKEN)
#define PA7MFP_KPI_COL1              NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_KPI_COL1)
#define PA7MFP_LPUART0_TXD           NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_LPUART0_TXD)
#define PA7MFP_LPIO5                 NVT_PINMUX('A', 7, SYS_GPA_MFP1_PA7MFP_LPIO5)
#define PA8MFP_GPIO                  NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_GPIO)
#define PA8MFP_EADC0_CH20            NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_EADC0_CH20)
#define PA8MFP_LPADC0_CH20           NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_LPADC0_CH20)
#define PA8MFP_EBI_ALE               NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_EBI_ALE)
#define PA8MFP_SC2_CLK               NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_SC2_CLK)
#define PA8MFP_SPI2_MOSI             NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_SPI2_MOSI)
#define PA8MFP_SD1_DAT0              NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_SD1_DAT0)
#define PA8MFP_USCI0_CTL1            NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_USCI0_CTL1)
#define PA8MFP_UART1_RXD             NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_UART1_RXD)
#define PA8MFP_UART7_RXD             NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_UART7_RXD)
#define PA8MFP_BPWM0_CH3             NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_BPWM0_CH3)
#define PA8MFP_EQEI1_B               NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_EQEI1_B)
#define PA8MFP_ECAP0_IC2             NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_ECAP0_IC2)
#define PA8MFP_I2S1_DO               NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_I2S1_DO)
#define PA8MFP_TM3_EXT               NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_TM3_EXT)
#define PA8MFP_INT4                  NVT_PINMUX('A', 8, SYS_GPA_MFP2_PA8MFP_INT4)
#define PA9MFP_GPIO                  NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_GPIO)
#define PA9MFP_EADC0_CH21            NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_EADC0_CH21)
#define PA9MFP_LPADC0_CH21           NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_LPADC0_CH21)
#define PA9MFP_EBI_MCLK              NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_EBI_MCLK)
#define PA9MFP_SC2_DAT               NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_SC2_DAT)
#define PA9MFP_SPI2_MISO             NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_SPI2_MISO)
#define PA9MFP_SD1_DAT1              NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_SD1_DAT1)
#define PA9MFP_USCI0_DAT1            NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_USCI0_DAT1)
#define PA9MFP_UART1_TXD             NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_UART1_TXD)
#define PA9MFP_UART7_TXD             NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_UART7_TXD)
#define PA9MFP_BPWM0_CH2             NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_BPWM0_CH2)
#define PA9MFP_EQEI1_A               NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_EQEI1_A)
#define PA9MFP_ECAP0_IC1             NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_ECAP0_IC1)
#define PA9MFP_I2S1_DI               NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_I2S1_DI)
#define PA9MFP_TM2_EXT               NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_TM2_EXT)
#define PA9MFP_SWDH_DAT              NVT_PINMUX('A', 9, SYS_GPA_MFP2_PA9MFP_SWDH_DAT)
#define PA10MFP_GPIO                 NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_GPIO)
#define PA10MFP_ACMP1_P0             NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_ACMP1_P0)
#define PA10MFP_EADC0_CH22           NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_EADC0_CH22)
#define PA10MFP_LPADC0_CH22          NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_LPADC0_CH22)
#define PA10MFP_EBI_nWR              NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_EBI_nWR)
#define PA10MFP_SC2_RST              NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_SC2_RST)
#define PA10MFP_SPI2_CLK             NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_SPI2_CLK)
#define PA10MFP_SD1_DAT2             NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_SD1_DAT2)
#define PA10MFP_USCI0_DAT0           NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_USCI0_DAT0)
#define PA10MFP_I2C2_SDA             NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_I2C2_SDA)
#define PA10MFP_UART6_RXD            NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_UART6_RXD)
#define PA10MFP_BPWM0_CH1            NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_BPWM0_CH1)
#define PA10MFP_EQEI1_INDEX          NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_EQEI1_INDEX)
#define PA10MFP_ECAP0_IC0            NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_ECAP0_IC0)
#define PA10MFP_I2S1_MCLK            NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_I2S1_MCLK)
#define PA10MFP_TM1_EXT              NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_TM1_EXT)
#define PA10MFP_DAC0_ST              NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_DAC0_ST)
#define PA10MFP_SWDH_CLK             NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_SWDH_CLK)
#define PA10MFP_KPI_ROW5             NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_KPI_ROW5)
#define PA10MFP_LPTM1_EXT            NVT_PINMUX('A', 10, SYS_GPA_MFP2_PA10MFP_LPTM1_EXT)
#define PA11MFP_GPIO                 NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_GPIO)
#define PA11MFP_ACMP0_P0             NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_ACMP0_P0)
#define PA11MFP_EADC0_CH23           NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_EADC0_CH23)
#define PA11MFP_LPADC0_CH23          NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_LPADC0_CH23)
#define PA11MFP_EBI_nRD              NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_EBI_nRD)
#define PA11MFP_SC2_PWR              NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_SC2_PWR)
#define PA11MFP_SPI2_SS              NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_SPI2_SS)
#define PA11MFP_SD1_DAT3             NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_SD1_DAT3)
#define PA11MFP_USCI0_CLK            NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_USCI0_CLK)
#define PA11MFP_I2C2_SCL             NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_I2C2_SCL)
#define PA11MFP_UART6_TXD            NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_UART6_TXD)
#define PA11MFP_BPWM0_CH0            NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_BPWM0_CH0)
#define PA11MFP_EPWM0_SYNC_OUT       NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_EPWM0_SYNC_OUT)
#define PA11MFP_EPWM0_BRAKE1         NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_EPWM0_BRAKE1)
#define PA11MFP_I2S1_BCLK            NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_I2S1_BCLK)
#define PA11MFP_TM0_EXT              NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_TM0_EXT)
#define PA11MFP_DAC1_ST              NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_DAC1_ST)
#define PA11MFP_KPI_ROW4             NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_KPI_ROW4)
#define PA11MFP_LPTM0_EXT            NVT_PINMUX('A', 11, SYS_GPA_MFP2_PA11MFP_LPTM0_EXT)
#define PA12MFP_GPIO                 NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_GPIO)
#define PA12MFP_I2S0_BCLK            NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_I2S0_BCLK)
#define PA12MFP_UART4_TXD            NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_UART4_TXD)
#define PA12MFP_I2C1_SCL             NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_I2C1_SCL)
#define PA12MFP_SPI2_SS              NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_SPI2_SS)
#define PA12MFP_CANFD0_TXD           NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_CANFD0_TXD)
#define PA12MFP_SC2_PWR              NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_SC2_PWR)
#define PA12MFP_SD1_nCD              NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_SD1_nCD)
#define PA12MFP_QSPI1_MISO0          NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_QSPI1_MISO0)
#define PA12MFP_BPWM1_CH2            NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_BPWM1_CH2)
#define PA12MFP_EQEI1_INDEX          NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_EQEI1_INDEX)
#define PA12MFP_ECAP3_IC0            NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_ECAP3_IC0)
#define PA12MFP_USB_VBUS             NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_USB_VBUS)
#define PA12MFP_PSIO0_CH4            NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_PSIO0_CH4)
#define PA12MFP_LPSPI0_SS            NVT_PINMUX('A', 12, SYS_GPA_MFP3_PA12MFP_LPSPI0_SS)
#define PA13MFP_GPIO                 NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_GPIO)
#define PA13MFP_I2S0_MCLK            NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_I2S0_MCLK)
#define PA13MFP_UART4_RXD            NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_UART4_RXD)
#define PA13MFP_I2C1_SDA             NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_I2C1_SDA)
#define PA13MFP_SPI2_CLK             NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_SPI2_CLK)
#define PA13MFP_CANFD0_RXD           NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_CANFD0_RXD)
#define PA13MFP_SC2_RST              NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_SC2_RST)
#define PA13MFP_QSPI1_MOSI0          NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_QSPI1_MOSI0)
#define PA13MFP_BPWM1_CH3            NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_BPWM1_CH3)
#define PA13MFP_EQEI1_A              NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_EQEI1_A)
#define PA13MFP_ECAP3_IC1            NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_ECAP3_IC1)
#define PA13MFP_USB_D_MINUS          NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_USB_D_MINUS)
#define PA13MFP_PSIO0_CH5            NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_PSIO0_CH5)
#define PA13MFP_LPSPI0_CLK           NVT_PINMUX('A', 13, SYS_GPA_MFP3_PA13MFP_LPSPI0_CLK)
#define PA14MFP_GPIO                 NVT_PINMUX('A', 14, SYS_GPA_MFP3_PA14MFP_GPIO)
#define PA14MFP_I2S0_DI              NVT_PINMUX('A', 14, SYS_GPA_MFP3_PA14MFP_I2S0_DI)
#define PA14MFP_UART0_TXD            NVT_PINMUX('A', 14, SYS_GPA_MFP3_PA14MFP_UART0_TXD)
#define PA14MFP_EBI_AD5              NVT_PINMUX('A', 14, SYS_GPA_MFP3_PA14MFP_EBI_AD5)
#define PA14MFP_SPI2_MISO            NVT_PINMUX('A', 14, SYS_GPA_MFP3_PA14MFP_SPI2_MISO)
#define PA14MFP_I2C2_SCL             NVT_PINMUX('A', 14, SYS_GPA_MFP3_PA14MFP_I2C2_SCL)
#define PA14MFP_SC2_DAT              NVT_PINMUX('A', 14, SYS_GPA_MFP3_PA14MFP_SC2_DAT)
#define PA14MFP_BPWM1_CH4            NVT_PINMUX('A', 14, SYS_GPA_MFP3_PA14MFP_BPWM1_CH4)
#define PA14MFP_EQEI1_B              NVT_PINMUX('A', 14, SYS_GPA_MFP3_PA14MFP_EQEI1_B)
#define PA14MFP_ECAP3_IC2            NVT_PINMUX('A', 14, SYS_GPA_MFP3_PA14MFP_ECAP3_IC2)
#define PA14MFP_USB_D_PLUS           NVT_PINMUX('A', 14, SYS_GPA_MFP3_PA14MFP_USB_D_PLUS)
#define PA14MFP_PSIO0_CH6            NVT_PINMUX('A', 14, SYS_GPA_MFP3_PA14MFP_PSIO0_CH6)
#define PA14MFP_LPSPI0_MISO          NVT_PINMUX('A', 14, SYS_GPA_MFP3_PA14MFP_LPSPI0_MISO)
#define PA15MFP_GPIO                 NVT_PINMUX('A', 15, SYS_GPA_MFP3_PA15MFP_GPIO)
#define PA15MFP_I2S0_DO              NVT_PINMUX('A', 15, SYS_GPA_MFP3_PA15MFP_I2S0_DO)
#define PA15MFP_UART0_RXD            NVT_PINMUX('A', 15, SYS_GPA_MFP3_PA15MFP_UART0_RXD)
#define PA15MFP_SPI2_MOSI            NVT_PINMUX('A', 15, SYS_GPA_MFP3_PA15MFP_SPI2_MOSI)
#define PA15MFP_I2C2_SDA             NVT_PINMUX('A', 15, SYS_GPA_MFP3_PA15MFP_I2C2_SDA)
