zephyrproject-rtos/hal_nuvoton/dts/pinctrl/m55m1h2l-pinctrl.h
#define PA15MFP_SC2_CLK              NVT_PINMUX('A', 15, SYS_GPA_MFP3_PA15MFP_SC2_CLK)
#define PA15MFP_BPWM1_CH5            NVT_PINMUX('A', 15, SYS_GPA_MFP3_PA15MFP_BPWM1_CH5)
#define PA15MFP_EPWM0_SYNC_IN        NVT_PINMUX('A', 15, SYS_GPA_MFP3_PA15MFP_EPWM0_SYNC_IN)
#define PA15MFP_EQEI3_INDEX          NVT_PINMUX('A', 15, SYS_GPA_MFP3_PA15MFP_EQEI3_INDEX)
#define PA15MFP_USB_OTG_ID           NVT_PINMUX('A', 15, SYS_GPA_MFP3_PA15MFP_USB_OTG_ID)
#define PA15MFP_PSIO0_CH7            NVT_PINMUX('A', 15, SYS_GPA_MFP3_PA15MFP_PSIO0_CH7)
#define PA15MFP_LPSPI0_MOSI          NVT_PINMUX('A', 15, SYS_GPA_MFP3_PA15MFP_LPSPI0_MOSI)
#define PB0MFP_GPIO                  NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_GPIO)
#define PB0MFP_ACMP3_N               NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_ACMP3_N)
#define PB0MFP_EADC0_CH0             NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_EADC0_CH0)
#define PB0MFP_LPADC0_CH0            NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_LPADC0_CH0)
#define PB0MFP_EBI_ADR9              NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_EBI_ADR9)
#define PB0MFP_SD0_CMD               NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_SD0_CMD)
#define PB0MFP_SPI2_I2SMCLK          NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_SPI2_I2SMCLK)
#define PB0MFP_USCI0_CTL0            NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_USCI0_CTL0)
#define PB0MFP_UART2_RXD             NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_UART2_RXD)
#define PB0MFP_SPI0_I2SMCLK          NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_SPI0_I2SMCLK)
#define PB0MFP_I2C1_SDA              NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_I2C1_SDA)
#define PB0MFP_I2S1_LRCK             NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_I2S1_LRCK)
#define PB0MFP_EPWM0_CH5             NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_EPWM0_CH5)
#define PB0MFP_EPWM1_CH5             NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_EPWM1_CH5)
#define PB0MFP_EPWM0_BRAKE1          NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_EPWM0_BRAKE1)
#define PB0MFP_ACMP3_O               NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_ACMP3_O)
#define PB0MFP_QSPI0_MOSI1           NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_QSPI0_MOSI1)
#define PB0MFP_I3C0_SDA              NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_I3C0_SDA)
#define PB0MFP_UTCPD0_VCNEN2         NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_UTCPD0_VCNEN2)
#define PB0MFP_KPI_ROW3              NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_KPI_ROW3)
#define PB0MFP_LPIO2                 NVT_PINMUX('B', 0, SYS_GPB_MFP0_PB0MFP_LPIO2)
#define PB1MFP_GPIO                  NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_GPIO)
#define PB1MFP_ACMP3_P0              NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_ACMP3_P0)
#define PB1MFP_EADC0_CH1             NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_EADC0_CH1)
#define PB1MFP_LPADC0_CH1            NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_LPADC0_CH1)
#define PB1MFP_EBI_ADR8              NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_EBI_ADR8)
#define PB1MFP_SD0_CLK               NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_SD0_CLK)
#define PB1MFP_EMAC0_RMII_RXERR      NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_EMAC0_RMII_RXERR)
#define PB1MFP_SPI1_I2SMCLK          NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_SPI1_I2SMCLK)
#define PB1MFP_SPI3_I2SMCLK          NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_SPI3_I2SMCLK)
#define PB1MFP_UART2_TXD             NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_UART2_TXD)
#define PB1MFP_I2C1_SCL              NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_I2C1_SCL)
#define PB1MFP_I2S0_LRCK             NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_I2S0_LRCK)
#define PB1MFP_EPWM0_CH4             NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_EPWM0_CH4)
#define PB1MFP_EPWM1_CH4             NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_EPWM1_CH4)
#define PB1MFP_EPWM0_BRAKE0          NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_EPWM0_BRAKE0)
#define PB1MFP_ACMP2_O               NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_ACMP2_O)
#define PB1MFP_QSPI0_MISO1           NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_QSPI0_MISO1)
#define PB1MFP_I3C0_SCL              NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_I3C0_SCL)
#define PB1MFP_UTCPD0_VBDCHG         NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_UTCPD0_VBDCHG)
#define PB1MFP_KPI_ROW2              NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_KPI_ROW2)
#define PB1MFP_LPIO3                 NVT_PINMUX('B', 1, SYS_GPB_MFP0_PB1MFP_LPIO3)
#define PB2MFP_GPIO                  NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_GPIO)
#define PB2MFP_ACMP0_P1              NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_ACMP0_P1)
#define PB2MFP_EADC0_CH2             NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_EADC0_CH2)
#define PB2MFP_LPADC0_CH2            NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_LPADC0_CH2)
#define PB2MFP_EBI_ADR3              NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_EBI_ADR3)
#define PB2MFP_SD0_DAT0              NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_SD0_DAT0)
#define PB2MFP_EMAC0_RMII_CRSDV      NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_EMAC0_RMII_CRSDV)
#define PB2MFP_SPI1_SS               NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_SPI1_SS)
#define PB2MFP_UART1_RXD             NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_UART1_RXD)
#define PB2MFP_UART5_nCTS            NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_UART5_nCTS)
#define PB2MFP_SC0_PWR               NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_SC0_PWR)
#define PB2MFP_I2S0_DO               NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_I2S0_DO)
#define PB2MFP_EPWM0_CH3             NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_EPWM0_CH3)
#define PB2MFP_I2C1_SDA              NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_I2C1_SDA)
#define PB2MFP_TM3                   NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_TM3)
#define PB2MFP_INT3                  NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_INT3)
#define PB2MFP_DMIC1_CLK             NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_DMIC1_CLK)
#define PB2MFP_PSIO0_CH7             NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_PSIO0_CH7)
#define PB2MFP_KPI_ROW1              NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_KPI_ROW1)
#define PB2MFP_LPIO6                 NVT_PINMUX('B', 2, SYS_GPB_MFP0_PB2MFP_LPIO6)
#define PB3MFP_GPIO                  NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_GPIO)
#define PB3MFP_ACMP0_N               NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_ACMP0_N)
#define PB3MFP_EADC0_CH3             NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_EADC0_CH3)
#define PB3MFP_LPADC0_CH3            NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_LPADC0_CH3)
#define PB3MFP_EBI_ADR2              NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_EBI_ADR2)
#define PB3MFP_SD0_DAT1              NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_SD0_DAT1)
#define PB3MFP_EMAC0_RMII_RXD1       NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_EMAC0_RMII_RXD1)
#define PB3MFP_SPI1_CLK              NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_SPI1_CLK)
#define PB3MFP_UART1_TXD             NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_UART1_TXD)
#define PB3MFP_UART5_nRTS            NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_UART5_nRTS)
#define PB3MFP_SC0_RST               NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_SC0_RST)
#define PB3MFP_I2S0_DI               NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_I2S0_DI)
#define PB3MFP_EPWM0_CH2             NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_EPWM0_CH2)
#define PB3MFP_I2C1_SCL              NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_I2C1_SCL)
#define PB3MFP_TM2                   NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_TM2)
#define PB3MFP_INT2                  NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_INT2)
#define PB3MFP_DMIC1_DAT             NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_DMIC1_DAT)
#define PB3MFP_PSIO0_CH6             NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_PSIO0_CH6)
#define PB3MFP_KPI_ROW0              NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_KPI_ROW0)
#define PB3MFP_LPIO7                 NVT_PINMUX('B', 3, SYS_GPB_MFP0_PB3MFP_LPIO7)
#define PB4MFP_GPIO                  NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_GPIO)
#define PB4MFP_ACMP1_P1              NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_ACMP1_P1)
#define PB4MFP_EADC0_CH4             NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_EADC0_CH4)
#define PB4MFP_LPADC0_CH4            NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_LPADC0_CH4)
#define PB4MFP_EBI_ADR1              NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_EBI_ADR1)
#define PB4MFP_SD0_DAT2              NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_SD0_DAT2)
#define PB4MFP_EMAC0_RMII_RXD0       NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_EMAC0_RMII_RXD0)
#define PB4MFP_SPI1_MOSI             NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_SPI1_MOSI)
#define PB4MFP_I2C0_SDA              NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_I2C0_SDA)
#define PB4MFP_UART5_RXD             NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_UART5_RXD)
#define PB4MFP_SC0_DAT               NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_SC0_DAT)
#define PB4MFP_I2S0_MCLK             NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_I2S0_MCLK)
#define PB4MFP_EPWM0_CH1             NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_EPWM0_CH1)
#define PB4MFP_UART2_RXD             NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_UART2_RXD)
#define PB4MFP_TM1                   NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_TM1)
#define PB4MFP_INT1                  NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_INT1)
#define PB4MFP_DMIC0_CLK             NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_DMIC0_CLK)
#define PB4MFP_PSIO0_CH5             NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_PSIO0_CH5)
#define PB4MFP_KPI_COL7              NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_KPI_COL7)
#define PB4MFP_LPI2C0_SDA            NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_LPI2C0_SDA)
#define PB4MFP_LPTM1                 NVT_PINMUX('B', 4, SYS_GPB_MFP1_PB4MFP_LPTM1)
#define PB5MFP_GPIO                  NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_GPIO)
#define PB5MFP_ACMP1_N               NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_ACMP1_N)
#define PB5MFP_EADC0_CH5             NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_EADC0_CH5)
#define PB5MFP_LPADC0_CH5            NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_LPADC0_CH5)
#define PB5MFP_EBI_ADR0              NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_EBI_ADR0)
#define PB5MFP_SD0_DAT3              NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_SD0_DAT3)
#define PB5MFP_EMAC0_RMII_REFCLK     NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_EMAC0_RMII_REFCLK)
#define PB5MFP_SPI1_MISO             NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_SPI1_MISO)
#define PB5MFP_I2C0_SCL              NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_I2C0_SCL)
#define PB5MFP_UART5_TXD             NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_UART5_TXD)
#define PB5MFP_SC0_CLK               NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_SC0_CLK)
#define PB5MFP_I2S0_BCLK             NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_I2S0_BCLK)
#define PB5MFP_EPWM0_CH0             NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_EPWM0_CH0)
#define PB5MFP_UART2_TXD             NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_UART2_TXD)
#define PB5MFP_TM0                   NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_TM0)
#define PB5MFP_INT0                  NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_INT0)
#define PB5MFP_DMIC0_DAT             NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_DMIC0_DAT)
#define PB5MFP_PSIO0_CH4             NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_PSIO0_CH4)
#define PB5MFP_KPI_COL6              NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_KPI_COL6)
#define PB5MFP_LPI2C0_SCL            NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_LPI2C0_SCL)
#define PB5MFP_LPTM0                 NVT_PINMUX('B', 5, SYS_GPB_MFP1_PB5MFP_LPTM0)
#define PB6MFP_GPIO                  NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_GPIO)
#define PB6MFP_ACMP2_N               NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_ACMP2_N)
#define PB6MFP_EADC0_CH6             NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_EADC0_CH6)
#define PB6MFP_LPADC0_CH6            NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_LPADC0_CH6)
#define PB6MFP_EBI_nWRH              NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_EBI_nWRH)
#define PB6MFP_EMAC0_PPS             NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_EMAC0_PPS)
#define PB6MFP_CANFD1_RXD            NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_CANFD1_RXD)
#define PB6MFP_UART1_RXD             NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_UART1_RXD)
#define PB6MFP_SD1_CLK               NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_SD1_CLK)
#define PB6MFP_EBI_nCS1              NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_EBI_nCS1)
#define PB6MFP_SPI0_CLK              NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_SPI0_CLK)
#define PB6MFP_BPWM1_CH5             NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_BPWM1_CH5)
#define PB6MFP_EPWM1_BRAKE1          NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_EPWM1_BRAKE1)
#define PB6MFP_EPWM1_CH5             NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_EPWM1_CH5)
#define PB6MFP_INT4                  NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_INT4)
#define PB6MFP_USB_VBUS_EN           NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_USB_VBUS_EN)
#define PB6MFP_ACMP1_O               NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_ACMP1_O)
#define PB6MFP_DMIC0_CLKLP           NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_DMIC0_CLKLP)
#define PB6MFP_EPWM0_SYNC_IN         NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_EPWM0_SYNC_IN)
#define PB6MFP_KPI_COL5              NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_KPI_COL5)
#define PB6MFP_SC1_nCD               NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_SC1_nCD)
#define PB6MFP_HSUSB_VBUS_EN         NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_HSUSB_VBUS_EN)
#define PB6MFP_TM1                   NVT_PINMUX('B', 6, SYS_GPB_MFP1_PB6MFP_TM1)
#define PB7MFP_GPIO                  NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_GPIO)
#define PB7MFP_ACMP2_P0              NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_ACMP2_P0)
#define PB7MFP_EADC0_CH7             NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_EADC0_CH7)
#define PB7MFP_LPADC0_CH7            NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_LPADC0_CH7)
#define PB7MFP_EBI_nWRL              NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_EBI_nWRL)
#define PB7MFP_EMAC0_RMII_TXEN       NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_EMAC0_RMII_TXEN)
#define PB7MFP_CCAP_DATA0            NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_CCAP_DATA0)
#define PB7MFP_CANFD1_TXD            NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_CANFD1_TXD)
#define PB7MFP_UART1_TXD             NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_UART1_TXD)
#define PB7MFP_SD1_CMD               NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_SD1_CMD)
#define PB7MFP_EBI_nCS0              NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_EBI_nCS0)
#define PB7MFP_SPI0_SS               NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_SPI0_SS)
#define PB7MFP_BPWM1_CH4             NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_BPWM1_CH4)
#define PB7MFP_EPWM1_BRAKE0          NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_EPWM1_BRAKE0)
#define PB7MFP_EPWM1_CH4             NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_EPWM1_CH4)
#define PB7MFP_INT5                  NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_INT5)
#define PB7MFP_USB_VBUS_ST           NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_USB_VBUS_ST)
#define PB7MFP_ACMP0_O               NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_ACMP0_O)
#define PB7MFP_ETMC_TRACE_DATA3      NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_ETMC_TRACE_DATA3)
#define PB7MFP_KPI_COL4              NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_KPI_COL4)
#define PB7MFP_TRACE_SWO             NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_TRACE_SWO)
#define PB7MFP_HSUSB_VBUS_ST         NVT_PINMUX('B', 7, SYS_GPB_MFP1_PB7MFP_HSUSB_VBUS_ST)
#define PB8MFP_GPIO                  NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_GPIO)
#define PB8MFP_ACMP2_P1              NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_ACMP2_P1)
#define PB8MFP_EADC0_CH8             NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_EADC0_CH8)
#define PB8MFP_LPADC0_CH8            NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_LPADC0_CH8)
#define PB8MFP_EBI_ADR19             NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_EBI_ADR19)
#define PB8MFP_EMAC0_RMII_TXD1       NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_EMAC0_RMII_TXD1)
#define PB8MFP_CCAP_DATA1            NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_CCAP_DATA1)
#define PB8MFP_UART0_RXD             NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_UART0_RXD)
#define PB8MFP_UART1_nRTS            NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_UART1_nRTS)
#define PB8MFP_I2C1_SMBSUS           NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_I2C1_SMBSUS)
#define PB8MFP_UART7_RXD             NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_UART7_RXD)
#define PB8MFP_I2C0_SDA              NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_I2C0_SDA)
#define PB8MFP_BPWM1_CH3             NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_BPWM1_CH3)
#define PB8MFP_SPI3_MOSI             NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_SPI3_MOSI)
#define PB8MFP_INT6                  NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_INT6)
#define PB8MFP_USB_VBUS_ST           NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_USB_VBUS_ST)
#define PB8MFP_USB_VBUS_EN           NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_USB_VBUS_EN)
#define PB8MFP_ETMC_TRACE_DATA2      NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_ETMC_TRACE_DATA2)
#define PB8MFP_LPUART0_RXD           NVT_PINMUX('B', 8, SYS_GPB_MFP2_PB8MFP_LPUART0_RXD)
#define PB9MFP_GPIO                  NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_GPIO)
#define PB9MFP_ACMP2_P2              NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_ACMP2_P2)
#define PB9MFP_EADC0_CH9             NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_EADC0_CH9)
#define PB9MFP_LPADC0_CH9            NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_LPADC0_CH9)
#define PB9MFP_EBI_ADR18             NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_EBI_ADR18)
#define PB9MFP_EMAC0_RMII_TXD0       NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_EMAC0_RMII_TXD0)
#define PB9MFP_UART0_TXD             NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_UART0_TXD)
#define PB9MFP_UART1_nCTS            NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_UART1_nCTS)
#define PB9MFP_I2C1_SMBAL            NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_I2C1_SMBAL)
#define PB9MFP_UART7_TXD             NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_UART7_TXD)
#define PB9MFP_I2C0_SCL              NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_I2C0_SCL)
#define PB9MFP_BPWM1_CH2             NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_BPWM1_CH2)
#define PB9MFP_SPI3_MISO             NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_SPI3_MISO)
#define PB9MFP_INT7                  NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_INT7)
#define PB9MFP_CCAP_HSYNC            NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_CCAP_HSYNC)
#define PB9MFP_USB_VBUS_ST           NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_USB_VBUS_ST)
#define PB9MFP_ETMC_TRACE_DATA1      NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_ETMC_TRACE_DATA1)
#define PB9MFP_LPUART0_TXD           NVT_PINMUX('B', 9, SYS_GPB_MFP2_PB9MFP_LPUART0_TXD)
#define PB10MFP_GPIO                 NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_GPIO)
#define PB10MFP_ACMP2_P3             NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_ACMP2_P3)
#define PB10MFP_EADC0_CH10           NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_EADC0_CH10)
#define PB10MFP_LPADC0_CH10          NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_LPADC0_CH10)
#define PB10MFP_EBI_ADR17            NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_EBI_ADR17)
#define PB10MFP_EMAC0_RMII_MDIO      NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_EMAC0_RMII_MDIO)
#define PB10MFP_UART0_nRTS           NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_UART0_nRTS)
#define PB10MFP_UART4_RXD            NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_UART4_RXD)
#define PB10MFP_I2C1_SDA             NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_I2C1_SDA)
#define PB10MFP_CANFD0_RXD           NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_CANFD0_RXD)
#define PB10MFP_BPWM1_CH1            NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_BPWM1_CH1)
#define PB10MFP_SPI3_SS              NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_SPI3_SS)
#define PB10MFP_CCAP_VSYNC           NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_CCAP_VSYNC)
#define PB10MFP_HSUSB_VBUS_EN        NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_HSUSB_VBUS_EN)
#define PB10MFP_ETMC_TRACE_DATA0     NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_ETMC_TRACE_DATA0)
#define PB10MFP_LPUART0_nRTS         NVT_PINMUX('B', 10, SYS_GPB_MFP2_PB10MFP_LPUART0_nRTS)
#define PB11MFP_GPIO                 NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_GPIO)
#define PB11MFP_EADC0_CH11           NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_EADC0_CH11)
#define PB11MFP_LPADC0_CH11          NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_LPADC0_CH11)
#define PB11MFP_EBI_ADR16            NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_EBI_ADR16)
#define PB11MFP_EMAC0_RMII_MDC       NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_EMAC0_RMII_MDC)
#define PB11MFP_UART0_nCTS           NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_UART0_nCTS)
#define PB11MFP_UART4_TXD            NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_UART4_TXD)
#define PB11MFP_I2C1_SCL             NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_I2C1_SCL)
#define PB11MFP_CANFD0_TXD           NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_CANFD0_TXD)
#define PB11MFP_SPI0_I2SMCLK         NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_SPI0_I2SMCLK)
#define PB11MFP_BPWM1_CH0            NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_BPWM1_CH0)
#define PB11MFP_SPI3_CLK             NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_SPI3_CLK)
#define PB11MFP_CCAP_SFIELD          NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_CCAP_SFIELD)
#define PB11MFP_HSUSB_VBUS_ST        NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_HSUSB_VBUS_ST)
#define PB11MFP_ETMC_TRACE_CLK       NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_ETMC_TRACE_CLK)
#define PB11MFP_LPUART0_nCTS         NVT_PINMUX('B', 11, SYS_GPB_MFP2_PB11MFP_LPUART0_nCTS)
#define PB12MFP_GPIO                 NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_GPIO)
#define PB12MFP_ACMP0_P2             NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_ACMP0_P2)
#define PB12MFP_ACMP1_P2             NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_ACMP1_P2)
#define PB12MFP_DAC0_OUT             NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_DAC0_OUT)
#define PB12MFP_EADC0_CH12           NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_EADC0_CH12)
#define PB12MFP_LPADC0_CH12          NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_LPADC0_CH12)
#define PB12MFP_EBI_AD15             NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_EBI_AD15)
#define PB12MFP_SC1_CLK              NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_SC1_CLK)
#define PB12MFP_SPI0_MOSI            NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_SPI0_MOSI)
#define PB12MFP_USCI0_CLK            NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_USCI0_CLK)
#define PB12MFP_UART0_RXD            NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_UART0_RXD)
#define PB12MFP_UART3_nCTS           NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_UART3_nCTS)
#define PB12MFP_I2C2_SDA             NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_I2C2_SDA)
#define PB12MFP_SD0_nCD              NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_SD0_nCD)
#define PB12MFP_CCAP_SCLK            NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_CCAP_SCLK)
#define PB12MFP_EPWM1_CH3            NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_EPWM1_CH3)
#define PB12MFP_ETMC_TRACE_DATA3     NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_ETMC_TRACE_DATA3)
#define PB12MFP_TM3_EXT              NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_TM3_EXT)
#define PB12MFP_EBI_AD11             NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_EBI_AD11)
#define PB12MFP_SPI0_I2SMCLK         NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_SPI0_I2SMCLK)
#define PB12MFP_SWODEC_SWO           NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_SWODEC_SWO)
#define PB12MFP_PSIO0_CH3            NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_PSIO0_CH3)
#define PB12MFP_KPI_COL3             NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_KPI_COL3)
#define PB12MFP_QSPI0_CLK            NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_QSPI0_CLK)
#define PB12MFP_LPSPI0_MOSI          NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_LPSPI0_MOSI)
#define PB12MFP_LPUART0_RXD          NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_LPUART0_RXD)
#define PB12MFP_UTCPD0_VBSRCEN       NVT_PINMUX('B', 12, SYS_GPB_MFP3_PB12MFP_UTCPD0_VBSRCEN)
#define PB13MFP_GPIO                 NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_GPIO)
#define PB13MFP_ACMP0_P3             NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_ACMP0_P3)
