zephyrproject-rtos/hal_nuvoton/dts/pinctrl/m55m1h2l-pinctrl.h
#define PB13MFP_ACMP1_P3             NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_ACMP1_P3)
#define PB13MFP_DAC1_OUT             NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_DAC1_OUT)
#define PB13MFP_EADC0_CH13           NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_EADC0_CH13)
#define PB13MFP_LPADC0_CH13          NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_LPADC0_CH13)
#define PB13MFP_EBI_AD14             NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_EBI_AD14)
#define PB13MFP_SC1_DAT              NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_SC1_DAT)
#define PB13MFP_SPI0_MISO            NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_SPI0_MISO)
#define PB13MFP_USCI0_DAT0           NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_USCI0_DAT0)
#define PB13MFP_UART0_TXD            NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_UART0_TXD)
#define PB13MFP_UART3_nRTS           NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_UART3_nRTS)
#define PB13MFP_I2C2_SCL             NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_I2C2_SCL)
#define PB13MFP_CLKO                 NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_CLKO)
#define PB13MFP_CCAP_PIXCLK          NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_CCAP_PIXCLK)
#define PB13MFP_EPWM1_CH2            NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_EPWM1_CH2)
#define PB13MFP_ETMC_TRACE_DATA2     NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_ETMC_TRACE_DATA2)
#define PB13MFP_TM2_EXT              NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_TM2_EXT)
#define PB13MFP_USB_VBUS_ST          NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_USB_VBUS_ST)
#define PB13MFP_HSUSB_VBUS_ST        NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_HSUSB_VBUS_ST)
#define PB13MFP_PSIO0_CH2            NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_PSIO0_CH2)
#define PB13MFP_KPI_COL2             NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_KPI_COL2)
#define PB13MFP_USCI0_CTL0           NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_USCI0_CTL0)
#define PB13MFP_LPSPI0_MISO          NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_LPSPI0_MISO)
#define PB13MFP_LPUART0_TXD          NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_LPUART0_TXD)
#define PB13MFP_UTCPD0_VBSNKEN       NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_UTCPD0_VBSNKEN)
#define PB13MFP_LPTM1                NVT_PINMUX('B', 13, SYS_GPB_MFP3_PB13MFP_LPTM1)
#define PB14MFP_GPIO                 NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_GPIO)
#define PB14MFP_EADC0_CH14           NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_EADC0_CH14)
#define PB14MFP_LPADC0_CH14          NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_LPADC0_CH14)
#define PB14MFP_EBI_AD13             NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_EBI_AD13)
#define PB14MFP_SC1_RST              NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_SC1_RST)
#define PB14MFP_SPI0_CLK             NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_SPI0_CLK)
#define PB14MFP_USCI0_DAT1           NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_USCI0_DAT1)
#define PB14MFP_UART0_nRTS           NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_UART0_nRTS)
#define PB14MFP_UART3_RXD            NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_UART3_RXD)
#define PB14MFP_I2C2_SMBSUS          NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_I2C2_SMBSUS)
#define PB14MFP_CCAP_DATA0           NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_CCAP_DATA0)
#define PB14MFP_EPWM1_CH1            NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_EPWM1_CH1)
#define PB14MFP_ETMC_TRACE_DATA1     NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_ETMC_TRACE_DATA1)
#define PB14MFP_TM1_EXT              NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_TM1_EXT)
#define PB14MFP_CLKO                 NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_CLKO)
#define PB14MFP_USB_VBUS_ST          NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_USB_VBUS_ST)
#define PB14MFP_PSIO0_CH1            NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_PSIO0_CH1)
#define PB14MFP_KPI_COL1             NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_KPI_COL1)
#define PB14MFP_UTCPD0_VBSRCEN       NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_UTCPD0_VBSRCEN)
#define PB14MFP_LPSPI0_CLK           NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_LPSPI0_CLK)
#define PB14MFP_LPUART0_nRTS         NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_LPUART0_nRTS)
#define PB14MFP_LPTM1_EXT            NVT_PINMUX('B', 14, SYS_GPB_MFP3_PB14MFP_LPTM1_EXT)
#define PB15MFP_GPIO                 NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_GPIO)
#define PB15MFP_EADC0_CH15           NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_EADC0_CH15)
#define PB15MFP_LPADC0_CH15          NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_LPADC0_CH15)
#define PB15MFP_EBI_AD12             NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_EBI_AD12)
#define PB15MFP_SC1_PWR              NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_SC1_PWR)
#define PB15MFP_SPI0_SS              NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_SPI0_SS)
#define PB15MFP_USCI0_CTL1           NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_USCI0_CTL1)
#define PB15MFP_UART0_nCTS           NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_UART0_nCTS)
#define PB15MFP_UART3_TXD            NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_UART3_TXD)
#define PB15MFP_I2C2_SMBAL           NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_I2C2_SMBAL)
#define PB15MFP_CCAP_DATA1           NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_CCAP_DATA1)
#define PB15MFP_EPWM0_BRAKE1         NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_EPWM0_BRAKE1)
#define PB15MFP_EPWM1_CH0            NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_EPWM1_CH0)
#define PB15MFP_ETMC_TRACE_DATA0     NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_ETMC_TRACE_DATA0)
#define PB15MFP_TM0_EXT              NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_TM0_EXT)
#define PB15MFP_USB_VBUS_EN          NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_USB_VBUS_EN)
#define PB15MFP_HSUSB_VBUS_EN        NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_HSUSB_VBUS_EN)
#define PB15MFP_PSIO0_CH0            NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_PSIO0_CH0)
#define PB15MFP_KPI_COL0             NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_KPI_COL0)
#define PB15MFP_UTCPD0_VBSNKEN       NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_UTCPD0_VBSNKEN)
#define PB15MFP_LPSPI0_SS            NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_LPSPI0_SS)
#define PB15MFP_LPUART0_nCTS         NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_LPUART0_nCTS)
#define PB15MFP_LPTM0_EXT            NVT_PINMUX('B', 15, SYS_GPB_MFP3_PB15MFP_LPTM0_EXT)
#define PC0MFP_GPIO                  NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_GPIO)
#define PC0MFP_EBI_AD0               NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_EBI_AD0)
#define PC0MFP_QSPI0_MOSI0           NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_QSPI0_MOSI0)
#define PC0MFP_SC1_CLK               NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_SC1_CLK)
#define PC0MFP_I2S0_LRCK             NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_I2S0_LRCK)
#define PC0MFP_SPI1_SS               NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_SPI1_SS)
#define PC0MFP_UART2_RXD             NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_UART2_RXD)
#define PC0MFP_I2C0_SDA              NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_I2C0_SDA)
#define PC0MFP_EPWM1_CH5             NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_EPWM1_CH5)
#define PC0MFP_CCAP_DATA0            NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_CCAP_DATA0)
#define PC0MFP_ACMP1_O               NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_ACMP1_O)
#define PC0MFP_KPI_ROW5              NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_KPI_ROW5)
#define PC0MFP_UTCPD0_CC1            NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_UTCPD0_CC1)
#define PC0MFP_LPI2C0_SDA            NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_LPI2C0_SDA)
#define PC0MFP_LPIO4                 NVT_PINMUX('C', 0, SYS_GPC_MFP0_PC0MFP_LPIO4)
#define PC1MFP_GPIO                  NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_GPIO)
#define PC1MFP_EBI_AD1               NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_EBI_AD1)
#define PC1MFP_QSPI0_MISO0           NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_QSPI0_MISO0)
#define PC1MFP_SC1_DAT               NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_SC1_DAT)
#define PC1MFP_I2S0_DO               NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_I2S0_DO)
#define PC1MFP_SPI1_CLK              NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_SPI1_CLK)
#define PC1MFP_UART2_TXD             NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_UART2_TXD)
#define PC1MFP_I2C0_SCL              NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_I2C0_SCL)
#define PC1MFP_EPWM1_CH4             NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_EPWM1_CH4)
#define PC1MFP_CCAP_DATA1            NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_CCAP_DATA1)
#define PC1MFP_ACMP0_O               NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_ACMP0_O)
#define PC1MFP_EADC0_ST              NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_EADC0_ST)
#define PC1MFP_KPI_ROW4              NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_KPI_ROW4)
#define PC1MFP_UTCPD0_CC2            NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_UTCPD0_CC2)
#define PC1MFP_LPADC0_ST             NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_LPADC0_ST)
#define PC1MFP_LPI2C0_SCL            NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_LPI2C0_SCL)
#define PC1MFP_LPIO5                 NVT_PINMUX('C', 1, SYS_GPC_MFP0_PC1MFP_LPIO5)
#define PC2MFP_GPIO                  NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_GPIO)
#define PC2MFP_EBI_AD2               NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_EBI_AD2)
#define PC2MFP_QSPI0_CLK             NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_QSPI0_CLK)
#define PC2MFP_SC1_RST               NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_SC1_RST)
#define PC2MFP_I2S0_DI               NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_I2S0_DI)
#define PC2MFP_SPI1_MOSI             NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_SPI1_MOSI)
#define PC2MFP_UART2_nCTS            NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_UART2_nCTS)
#define PC2MFP_I2C0_SMBSUS           NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_I2C0_SMBSUS)
#define PC2MFP_CANFD1_RXD            NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_CANFD1_RXD)
#define PC2MFP_UART3_RXD             NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_UART3_RXD)
#define PC2MFP_EPWM1_CH3             NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_EPWM1_CH3)
#define PC2MFP_CCAP_DATA2            NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_CCAP_DATA2)
#define PC2MFP_QSPI1_MOSI0           NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_QSPI1_MOSI0)
#define PC2MFP_I2C3_SDA              NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_I2C3_SDA)
#define PC2MFP_PSIO0_CH3             NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_PSIO0_CH3)
#define PC2MFP_KPI_ROW3              NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_KPI_ROW3)
#define PC2MFP_UTCPD0_CCDB1          NVT_PINMUX('C', 2, SYS_GPC_MFP0_PC2MFP_UTCPD0_CCDB1)
#define PC3MFP_GPIO                  NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_GPIO)
#define PC3MFP_EBI_AD3               NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_EBI_AD3)
#define PC3MFP_QSPI0_SS              NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_QSPI0_SS)
#define PC3MFP_SC1_PWR               NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_SC1_PWR)
#define PC3MFP_I2S0_MCLK             NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_I2S0_MCLK)
#define PC3MFP_SPI1_MISO             NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_SPI1_MISO)
#define PC3MFP_UART2_nRTS            NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_UART2_nRTS)
#define PC3MFP_I2C0_SMBAL            NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_I2C0_SMBAL)
#define PC3MFP_CANFD1_TXD            NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_CANFD1_TXD)
#define PC3MFP_UART3_TXD             NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_UART3_TXD)
#define PC3MFP_EPWM1_CH2             NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_EPWM1_CH2)
#define PC3MFP_CCAP_DATA3            NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_CCAP_DATA3)
#define PC3MFP_QSPI1_MISO0           NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_QSPI1_MISO0)
#define PC3MFP_I2C3_SCL              NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_I2C3_SCL)
#define PC3MFP_PSIO0_CH2             NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_PSIO0_CH2)
#define PC3MFP_KPI_ROW2              NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_KPI_ROW2)
#define PC3MFP_UTCPD0_CCDB2          NVT_PINMUX('C', 3, SYS_GPC_MFP0_PC3MFP_UTCPD0_CCDB2)
#define PC4MFP_GPIO                  NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_GPIO)
#define PC4MFP_EBI_AD4               NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_EBI_AD4)
#define PC4MFP_QSPI0_MOSI1           NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_QSPI0_MOSI1)
#define PC4MFP_SC1_nCD               NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_SC1_nCD)
#define PC4MFP_I2S0_BCLK             NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_I2S0_BCLK)
#define PC4MFP_SPI1_I2SMCLK          NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_SPI1_I2SMCLK)
#define PC4MFP_UART2_RXD             NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_UART2_RXD)
#define PC4MFP_I2C1_SDA              NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_I2C1_SDA)
#define PC4MFP_CANFD0_RXD            NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_CANFD0_RXD)
#define PC4MFP_UART4_RXD             NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_UART4_RXD)
#define PC4MFP_EPWM1_CH1             NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_EPWM1_CH1)
#define PC4MFP_CCAP_DATA4            NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_CCAP_DATA4)
#define PC4MFP_QSPI1_CLK             NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_QSPI1_CLK)
#define PC4MFP_I2C3_SMBSUS           NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_I2C3_SMBSUS)
#define PC4MFP_PSIO0_CH1             NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_PSIO0_CH1)
#define PC4MFP_KPI_ROW1              NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_KPI_ROW1)
#define PC4MFP_UTCPD0_FRSTX1         NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_UTCPD0_FRSTX1)
#define PC4MFP_UTCPD0_DISCHG         NVT_PINMUX('C', 4, SYS_GPC_MFP1_PC4MFP_UTCPD0_DISCHG)
#define PC5MFP_GPIO                  NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_GPIO)
#define PC5MFP_EBI_AD5               NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_EBI_AD5)
#define PC5MFP_QSPI0_MISO1           NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_QSPI0_MISO1)
#define PC5MFP_UART2_TXD             NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_UART2_TXD)
#define PC5MFP_I2C1_SCL              NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_I2C1_SCL)
#define PC5MFP_CANFD0_TXD            NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_CANFD0_TXD)
#define PC5MFP_UART4_TXD             NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_UART4_TXD)
#define PC5MFP_EPWM1_CH0             NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_EPWM1_CH0)
#define PC5MFP_CCAP_DATA5            NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_CCAP_DATA5)
#define PC5MFP_QSPI1_SS              NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_QSPI1_SS)
#define PC5MFP_I2C3_SMBAL            NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_I2C3_SMBAL)
#define PC5MFP_PSIO0_CH0             NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_PSIO0_CH0)
#define PC5MFP_KPI_ROW0              NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_KPI_ROW0)
#define PC5MFP_UTCPD0_FRSTX2         NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_UTCPD0_FRSTX2)
#define PC5MFP_UTCPD0_DISCHG         NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_UTCPD0_DISCHG)
#define PC5MFP_I3C0_PUPEN            NVT_PINMUX('C', 5, SYS_GPC_MFP1_PC5MFP_I3C0_PUPEN)
#define PC6MFP_GPIO                  NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_GPIO)
#define PC6MFP_EBI_AD8               NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_EBI_AD8)
#define PC6MFP_EMAC0_RMII_RXD1       NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_EMAC0_RMII_RXD1)
#define PC6MFP_SPI1_MOSI             NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_SPI1_MOSI)
#define PC6MFP_UART4_RXD             NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_UART4_RXD)
#define PC6MFP_SC2_RST               NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_SC2_RST)
#define PC6MFP_UART0_nRTS            NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_UART0_nRTS)
#define PC6MFP_I2C1_SMBSUS           NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_I2C1_SMBSUS)
#define PC6MFP_UART6_RXD             NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_UART6_RXD)
#define PC6MFP_ACMP3_WLAT            NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_ACMP3_WLAT)
#define PC6MFP_EPWM1_CH3             NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_EPWM1_CH3)
#define PC6MFP_BPWM1_CH1             NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_BPWM1_CH1)
#define PC6MFP_TM1                   NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_TM1)
#define PC6MFP_INT2                  NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_INT2)
#define PC6MFP_UTCPD0_FRSTX2         NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_UTCPD0_FRSTX2)
#define PC6MFP_KPI_COL2              NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_KPI_COL2)
#define PC6MFP_UTCPD0_DISCHG         NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_UTCPD0_DISCHG)
#define PC6MFP_LPUART0_nRTS          NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_LPUART0_nRTS)
#define PC6MFP_LPTM1                 NVT_PINMUX('C', 6, SYS_GPC_MFP1_PC6MFP_LPTM1)
#define PC7MFP_GPIO                  NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_GPIO)
#define PC7MFP_EBI_AD9               NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_EBI_AD9)
#define PC7MFP_EMAC0_RMII_RXD0       NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_EMAC0_RMII_RXD0)
#define PC7MFP_SPI1_MISO             NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_SPI1_MISO)
#define PC7MFP_UART4_TXD             NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_UART4_TXD)
#define PC7MFP_SC2_PWR               NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_SC2_PWR)
#define PC7MFP_UART0_nCTS            NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_UART0_nCTS)
#define PC7MFP_I2C1_SMBAL            NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_I2C1_SMBAL)
#define PC7MFP_UART6_TXD             NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_UART6_TXD)
#define PC7MFP_ACMP2_WLAT            NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_ACMP2_WLAT)
#define PC7MFP_EPWM1_CH2             NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_EPWM1_CH2)
#define PC7MFP_BPWM1_CH0             NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_BPWM1_CH0)
#define PC7MFP_TM0                   NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_TM0)
#define PC7MFP_INT3                  NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_INT3)
#define PC7MFP_KPI_COL3              NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_KPI_COL3)
#define PC7MFP_LPUART0_nCTS          NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_LPUART0_nCTS)
#define PC7MFP_LPTM0                 NVT_PINMUX('C', 7, SYS_GPC_MFP1_PC7MFP_LPTM0)
#define PC8MFP_GPIO                  NVT_PINMUX('C', 8, SYS_GPC_MFP2_PC8MFP_GPIO)
#define PC8MFP_EBI_ADR16             NVT_PINMUX('C', 8, SYS_GPC_MFP2_PC8MFP_EBI_ADR16)
#define PC8MFP_EMAC0_RMII_REFCLK     NVT_PINMUX('C', 8, SYS_GPC_MFP2_PC8MFP_EMAC0_RMII_REFCLK)
#define PC8MFP_I2C0_SDA              NVT_PINMUX('C', 8, SYS_GPC_MFP2_PC8MFP_I2C0_SDA)
#define PC8MFP_UART4_nCTS            NVT_PINMUX('C', 8, SYS_GPC_MFP2_PC8MFP_UART4_nCTS)
#define PC8MFP_UART1_RXD             NVT_PINMUX('C', 8, SYS_GPC_MFP2_PC8MFP_UART1_RXD)
#define PC8MFP_EPWM1_CH1             NVT_PINMUX('C', 8, SYS_GPC_MFP2_PC8MFP_EPWM1_CH1)
#define PC8MFP_BPWM1_CH4             NVT_PINMUX('C', 8, SYS_GPC_MFP2_PC8MFP_BPWM1_CH4)
#define PC8MFP_SWODEC_SWO            NVT_PINMUX('C', 8, SYS_GPC_MFP2_PC8MFP_SWODEC_SWO)
#define PC8MFP_KPI_COL4              NVT_PINMUX('C', 8, SYS_GPC_MFP2_PC8MFP_KPI_COL4)
#define PC8MFP_LPI2C0_SDA            NVT_PINMUX('C', 8, SYS_GPC_MFP2_PC8MFP_LPI2C0_SDA)
#define PC9MFP_GPIO                  NVT_PINMUX('C', 9, SYS_GPC_MFP2_PC9MFP_GPIO)
#define PC9MFP_ACMP3_P1              NVT_PINMUX('C', 9, SYS_GPC_MFP2_PC9MFP_ACMP3_P1)
#define PC9MFP_EBI_ADR7              NVT_PINMUX('C', 9, SYS_GPC_MFP2_PC9MFP_EBI_ADR7)
#define PC9MFP_UART6_nCTS            NVT_PINMUX('C', 9, SYS_GPC_MFP2_PC9MFP_UART6_nCTS)
#define PC9MFP_SPI3_SS               NVT_PINMUX('C', 9, SYS_GPC_MFP2_PC9MFP_SPI3_SS)
#define PC9MFP_UART3_RXD             NVT_PINMUX('C', 9, SYS_GPC_MFP2_PC9MFP_UART3_RXD)
#define PC9MFP_CANFD1_RXD            NVT_PINMUX('C', 9, SYS_GPC_MFP2_PC9MFP_CANFD1_RXD)
#define PC9MFP_EPWM1_CH3             NVT_PINMUX('C', 9, SYS_GPC_MFP2_PC9MFP_EPWM1_CH3)
#define PC9MFP_I3C0_PUPEN            NVT_PINMUX('C', 9, SYS_GPC_MFP2_PC9MFP_I3C0_PUPEN)
#define PC10MFP_GPIO                 NVT_PINMUX('C', 10, SYS_GPC_MFP2_PC10MFP_GPIO)
#define PC10MFP_ACMP3_P2             NVT_PINMUX('C', 10, SYS_GPC_MFP2_PC10MFP_ACMP3_P2)
#define PC10MFP_EBI_ADR6             NVT_PINMUX('C', 10, SYS_GPC_MFP2_PC10MFP_EBI_ADR6)
#define PC10MFP_UART6_nRTS           NVT_PINMUX('C', 10, SYS_GPC_MFP2_PC10MFP_UART6_nRTS)
#define PC10MFP_SPI3_CLK             NVT_PINMUX('C', 10, SYS_GPC_MFP2_PC10MFP_SPI3_CLK)
#define PC10MFP_UART3_TXD            NVT_PINMUX('C', 10, SYS_GPC_MFP2_PC10MFP_UART3_TXD)
#define PC10MFP_CANFD1_TXD           NVT_PINMUX('C', 10, SYS_GPC_MFP2_PC10MFP_CANFD1_TXD)
#define PC10MFP_ECAP1_IC0            NVT_PINMUX('C', 10, SYS_GPC_MFP2_PC10MFP_ECAP1_IC0)
#define PC10MFP_EPWM1_CH2            NVT_PINMUX('C', 10, SYS_GPC_MFP2_PC10MFP_EPWM1_CH2)
#define PC11MFP_GPIO                 NVT_PINMUX('C', 11, SYS_GPC_MFP2_PC11MFP_GPIO)
#define PC11MFP_ACMP3_P3             NVT_PINMUX('C', 11, SYS_GPC_MFP2_PC11MFP_ACMP3_P3)
#define PC11MFP_EBI_ADR5             NVT_PINMUX('C', 11, SYS_GPC_MFP2_PC11MFP_EBI_ADR5)
#define PC11MFP_UART0_RXD            NVT_PINMUX('C', 11, SYS_GPC_MFP2_PC11MFP_UART0_RXD)
#define PC11MFP_I2C0_SDA             NVT_PINMUX('C', 11, SYS_GPC_MFP2_PC11MFP_I2C0_SDA)
#define PC11MFP_UART6_RXD            NVT_PINMUX('C', 11, SYS_GPC_MFP2_PC11MFP_UART6_RXD)
#define PC11MFP_SPI3_MOSI            NVT_PINMUX('C', 11, SYS_GPC_MFP2_PC11MFP_SPI3_MOSI)
#define PC11MFP_ECAP1_IC1            NVT_PINMUX('C', 11, SYS_GPC_MFP2_PC11MFP_ECAP1_IC1)
#define PC11MFP_EPWM1_CH1            NVT_PINMUX('C', 11, SYS_GPC_MFP2_PC11MFP_EPWM1_CH1)
#define PC11MFP_ACMP1_O              NVT_PINMUX('C', 11, SYS_GPC_MFP2_PC11MFP_ACMP1_O)
#define PC11MFP_LPUART0_RXD          NVT_PINMUX('C', 11, SYS_GPC_MFP2_PC11MFP_LPUART0_RXD)
#define PC11MFP_LPI2C0_SDA           NVT_PINMUX('C', 11, SYS_GPC_MFP2_PC11MFP_LPI2C0_SDA)
#define PC12MFP_GPIO                 NVT_PINMUX('C', 12, SYS_GPC_MFP3_PC12MFP_GPIO)
#define PC12MFP_EBI_ADR4             NVT_PINMUX('C', 12, SYS_GPC_MFP3_PC12MFP_EBI_ADR4)
#define PC12MFP_UART0_TXD            NVT_PINMUX('C', 12, SYS_GPC_MFP3_PC12MFP_UART0_TXD)
#define PC12MFP_I2C0_SCL             NVT_PINMUX('C', 12, SYS_GPC_MFP3_PC12MFP_I2C0_SCL)
#define PC12MFP_UART6_TXD            NVT_PINMUX('C', 12, SYS_GPC_MFP3_PC12MFP_UART6_TXD)
#define PC12MFP_SPI3_MISO            NVT_PINMUX('C', 12, SYS_GPC_MFP3_PC12MFP_SPI3_MISO)
#define PC12MFP_SC0_nCD              NVT_PINMUX('C', 12, SYS_GPC_MFP3_PC12MFP_SC0_nCD)
#define PC12MFP_ECAP1_IC2            NVT_PINMUX('C', 12, SYS_GPC_MFP3_PC12MFP_ECAP1_IC2)
#define PC12MFP_EPWM1_CH0            NVT_PINMUX('C', 12, SYS_GPC_MFP3_PC12MFP_EPWM1_CH0)
#define PC12MFP_ACMP0_O              NVT_PINMUX('C', 12, SYS_GPC_MFP3_PC12MFP_ACMP0_O)
#define PC12MFP_LPUART0_TXD          NVT_PINMUX('C', 12, SYS_GPC_MFP3_PC12MFP_LPUART0_TXD)
#define PC12MFP_LPI2C0_SCL           NVT_PINMUX('C', 12, SYS_GPC_MFP3_PC12MFP_LPI2C0_SCL)
#define PC13MFP_GPIO                 NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_GPIO)
#define PC13MFP_EADC0_CH19           NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_EADC0_CH19)
#define PC13MFP_LPADC0_CH19          NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_LPADC0_CH19)
#define PC13MFP_EBI_ADR10            NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_EBI_ADR10)
#define PC13MFP_SC2_nCD              NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_SC2_nCD)
#define PC13MFP_SPI2_I2SMCLK         NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_SPI2_I2SMCLK)
#define PC13MFP_CANFD1_TXD           NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_CANFD1_TXD)
#define PC13MFP_USCI0_CTL0           NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_USCI0_CTL0)
#define PC13MFP_UART2_TXD            NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_UART2_TXD)
#define PC13MFP_UART8_nCTS           NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_UART8_nCTS)
#define PC13MFP_BPWM0_CH4            NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_BPWM0_CH4)
#define PC13MFP_CLKO                 NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_CLKO)
#define PC13MFP_EADC0_ST             NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_EADC0_ST)
#define PC13MFP_LPADC0_ST            NVT_PINMUX('C', 13, SYS_GPC_MFP3_PC13MFP_LPADC0_ST)
