zephyrproject-rtos/hal_nuvoton/dts/pinctrl/m55m1h2l-pinctrl.h
#define PD0MFP_GPIO                  NVT_PINMUX('D', 0, SYS_GPD_MFP0_PD0MFP_GPIO)
#define PD0MFP_EBI_AD13              NVT_PINMUX('D', 0, SYS_GPD_MFP0_PD0MFP_EBI_AD13)
#define PD0MFP_USCI0_CLK             NVT_PINMUX('D', 0, SYS_GPD_MFP0_PD0MFP_USCI0_CLK)
#define PD0MFP_SPI0_MOSI             NVT_PINMUX('D', 0, SYS_GPD_MFP0_PD0MFP_SPI0_MOSI)
#define PD0MFP_UART3_RXD             NVT_PINMUX('D', 0, SYS_GPD_MFP0_PD0MFP_UART3_RXD)
#define PD0MFP_I2C2_SDA              NVT_PINMUX('D', 0, SYS_GPD_MFP0_PD0MFP_I2C2_SDA)
#define PD0MFP_SC2_CLK               NVT_PINMUX('D', 0, SYS_GPD_MFP0_PD0MFP_SC2_CLK)
#define PD0MFP_I2S1_DO               NVT_PINMUX('D', 0, SYS_GPD_MFP0_PD0MFP_I2S1_DO)
#define PD0MFP_EQEI2_A               NVT_PINMUX('D', 0, SYS_GPD_MFP0_PD0MFP_EQEI2_A)
#define PD0MFP_ECAP2_IC1             NVT_PINMUX('D', 0, SYS_GPD_MFP0_PD0MFP_ECAP2_IC1)
#define PD0MFP_TM2                   NVT_PINMUX('D', 0, SYS_GPD_MFP0_PD0MFP_TM2)
#define PD0MFP_LPSPI0_MOSI           NVT_PINMUX('D', 0, SYS_GPD_MFP0_PD0MFP_LPSPI0_MOSI)
#define PD0MFP_LPIO6                 NVT_PINMUX('D', 0, SYS_GPD_MFP0_PD0MFP_LPIO6)
#define PD1MFP_GPIO                  NVT_PINMUX('D', 1, SYS_GPD_MFP0_PD1MFP_GPIO)
#define PD1MFP_EBI_AD12              NVT_PINMUX('D', 1, SYS_GPD_MFP0_PD1MFP_EBI_AD12)
#define PD1MFP_USCI0_DAT0            NVT_PINMUX('D', 1, SYS_GPD_MFP0_PD1MFP_USCI0_DAT0)
#define PD1MFP_SPI0_MISO             NVT_PINMUX('D', 1, SYS_GPD_MFP0_PD1MFP_SPI0_MISO)
#define PD1MFP_UART3_TXD             NVT_PINMUX('D', 1, SYS_GPD_MFP0_PD1MFP_UART3_TXD)
#define PD1MFP_I2C2_SCL              NVT_PINMUX('D', 1, SYS_GPD_MFP0_PD1MFP_I2C2_SCL)
#define PD1MFP_SC2_DAT               NVT_PINMUX('D', 1, SYS_GPD_MFP0_PD1MFP_SC2_DAT)
#define PD1MFP_I2S1_DI               NVT_PINMUX('D', 1, SYS_GPD_MFP0_PD1MFP_I2S1_DI)
#define PD1MFP_EQEI2_INDEX           NVT_PINMUX('D', 1, SYS_GPD_MFP0_PD1MFP_EQEI2_INDEX)
#define PD1MFP_ECAP2_IC0             NVT_PINMUX('D', 1, SYS_GPD_MFP0_PD1MFP_ECAP2_IC0)
#define PD1MFP_LPSPI0_MISO           NVT_PINMUX('D', 1, SYS_GPD_MFP0_PD1MFP_LPSPI0_MISO)
#define PD1MFP_LPIO7                 NVT_PINMUX('D', 1, SYS_GPD_MFP0_PD1MFP_LPIO7)
#define PD2MFP_GPIO                  NVT_PINMUX('D', 2, SYS_GPD_MFP0_PD2MFP_GPIO)
#define PD2MFP_EBI_AD11              NVT_PINMUX('D', 2, SYS_GPD_MFP0_PD2MFP_EBI_AD11)
#define PD2MFP_USCI0_DAT1            NVT_PINMUX('D', 2, SYS_GPD_MFP0_PD2MFP_USCI0_DAT1)
#define PD2MFP_SPI0_CLK              NVT_PINMUX('D', 2, SYS_GPD_MFP0_PD2MFP_SPI0_CLK)
#define PD2MFP_UART3_nCTS            NVT_PINMUX('D', 2, SYS_GPD_MFP0_PD2MFP_UART3_nCTS)
#define PD2MFP_SC2_RST               NVT_PINMUX('D', 2, SYS_GPD_MFP0_PD2MFP_SC2_RST)
#define PD2MFP_UART0_RXD             NVT_PINMUX('D', 2, SYS_GPD_MFP0_PD2MFP_UART0_RXD)
#define PD2MFP_I2S1_MCLK             NVT_PINMUX('D', 2, SYS_GPD_MFP0_PD2MFP_I2S1_MCLK)
#define PD2MFP_EQEI3_B               NVT_PINMUX('D', 2, SYS_GPD_MFP0_PD2MFP_EQEI3_B)
#define PD2MFP_LPSPI0_CLK            NVT_PINMUX('D', 2, SYS_GPD_MFP0_PD2MFP_LPSPI0_CLK)
#define PD2MFP_LPUART0_RXD           NVT_PINMUX('D', 2, SYS_GPD_MFP0_PD2MFP_LPUART0_RXD)
#define PD3MFP_GPIO                  NVT_PINMUX('D', 3, SYS_GPD_MFP0_PD3MFP_GPIO)
#define PD3MFP_EBI_AD10              NVT_PINMUX('D', 3, SYS_GPD_MFP0_PD3MFP_EBI_AD10)
#define PD3MFP_USCI0_CTL1            NVT_PINMUX('D', 3, SYS_GPD_MFP0_PD3MFP_USCI0_CTL1)
#define PD3MFP_SPI0_SS               NVT_PINMUX('D', 3, SYS_GPD_MFP0_PD3MFP_SPI0_SS)
#define PD3MFP_UART3_nRTS            NVT_PINMUX('D', 3, SYS_GPD_MFP0_PD3MFP_UART3_nRTS)
#define PD3MFP_SC2_PWR               NVT_PINMUX('D', 3, SYS_GPD_MFP0_PD3MFP_SC2_PWR)
#define PD3MFP_SC1_nCD               NVT_PINMUX('D', 3, SYS_GPD_MFP0_PD3MFP_SC1_nCD)
#define PD3MFP_UART0_TXD             NVT_PINMUX('D', 3, SYS_GPD_MFP0_PD3MFP_UART0_TXD)
#define PD3MFP_I2S1_BCLK             NVT_PINMUX('D', 3, SYS_GPD_MFP0_PD3MFP_I2S1_BCLK)
#define PD3MFP_EQEI3_A               NVT_PINMUX('D', 3, SYS_GPD_MFP0_PD3MFP_EQEI3_A)
#define PD3MFP_LPSPI0_SS             NVT_PINMUX('D', 3, SYS_GPD_MFP0_PD3MFP_LPSPI0_SS)
#define PD3MFP_LPUART0_TXD           NVT_PINMUX('D', 3, SYS_GPD_MFP0_PD3MFP_LPUART0_TXD)
#define PD4MFP_GPIO                  NVT_PINMUX('D', 4, SYS_GPD_MFP1_PD4MFP_GPIO)
#define PD4MFP_USCI0_CTL0            NVT_PINMUX('D', 4, SYS_GPD_MFP1_PD4MFP_USCI0_CTL0)
#define PD4MFP_I2C1_SDA              NVT_PINMUX('D', 4, SYS_GPD_MFP1_PD4MFP_I2C1_SDA)
#define PD4MFP_SPI1_SS               NVT_PINMUX('D', 4, SYS_GPD_MFP1_PD4MFP_SPI1_SS)
#define PD4MFP_SC1_CLK               NVT_PINMUX('D', 4, SYS_GPD_MFP1_PD4MFP_SC1_CLK)
#define PD4MFP_USB_VBUS_ST           NVT_PINMUX('D', 4, SYS_GPD_MFP1_PD4MFP_USB_VBUS_ST)
#define PD4MFP_PSIO0_CH7             NVT_PINMUX('D', 4, SYS_GPD_MFP1_PD4MFP_PSIO0_CH7)
#define PD5MFP_GPIO                  NVT_PINMUX('D', 5, SYS_GPD_MFP1_PD5MFP_GPIO)
#define PD5MFP_EBI_AD15              NVT_PINMUX('D', 5, SYS_GPD_MFP1_PD5MFP_EBI_AD15)
#define PD5MFP_SD1_nCD               NVT_PINMUX('D', 5, SYS_GPD_MFP1_PD5MFP_SD1_nCD)
#define PD5MFP_EBI_nCS0              NVT_PINMUX('D', 5, SYS_GPD_MFP1_PD5MFP_EBI_nCS0)
#define PD5MFP_CLKO                  NVT_PINMUX('D', 5, SYS_GPD_MFP1_PD5MFP_CLKO)
#define PD5MFP_EADC0_ST              NVT_PINMUX('D', 5, SYS_GPD_MFP1_PD5MFP_EADC0_ST)
#define PD5MFP_LPADC0_ST             NVT_PINMUX('D', 5, SYS_GPD_MFP1_PD5MFP_LPADC0_ST)
#define PD6MFP_GPIO                  NVT_PINMUX('D', 6, SYS_GPD_MFP1_PD6MFP_GPIO)
#define PD6MFP_EBI_AD5               NVT_PINMUX('D', 6, SYS_GPD_MFP1_PD6MFP_EBI_AD5)
#define PD6MFP_SD1_CLK               NVT_PINMUX('D', 6, SYS_GPD_MFP1_PD6MFP_SD1_CLK)
#define PD6MFP_QSPI1_MOSI0           NVT_PINMUX('D', 6, SYS_GPD_MFP1_PD6MFP_QSPI1_MOSI0)
#define PD6MFP_UART6_RXD             NVT_PINMUX('D', 6, SYS_GPD_MFP1_PD6MFP_UART6_RXD)
#define PD6MFP_BPWM0_CH0             NVT_PINMUX('D', 6, SYS_GPD_MFP1_PD6MFP_BPWM0_CH0)
#define PD7MFP_GPIO                  NVT_PINMUX('D', 7, SYS_GPD_MFP1_PD7MFP_GPIO)
#define PD7MFP_EBI_AD4               NVT_PINMUX('D', 7, SYS_GPD_MFP1_PD7MFP_EBI_AD4)
#define PD7MFP_SD1_CMD               NVT_PINMUX('D', 7, SYS_GPD_MFP1_PD7MFP_SD1_CMD)
#define PD7MFP_QSPI1_MISO0           NVT_PINMUX('D', 7, SYS_GPD_MFP1_PD7MFP_QSPI1_MISO0)
#define PD7MFP_UART6_TXD             NVT_PINMUX('D', 7, SYS_GPD_MFP1_PD7MFP_UART6_TXD)
#define PD7MFP_CCAP_HSYNC            NVT_PINMUX('D', 7, SYS_GPD_MFP1_PD7MFP_CCAP_HSYNC)
#define PD7MFP_BPWM0_CH1             NVT_PINMUX('D', 7, SYS_GPD_MFP1_PD7MFP_BPWM0_CH1)
#define PD8MFP_GPIO                  NVT_PINMUX('D', 8, SYS_GPD_MFP2_PD8MFP_GPIO)
#define PD8MFP_EBI_AD6               NVT_PINMUX('D', 8, SYS_GPD_MFP2_PD8MFP_EBI_AD6)
#define PD8MFP_I2C2_SDA              NVT_PINMUX('D', 8, SYS_GPD_MFP2_PD8MFP_I2C2_SDA)
#define PD8MFP_UART2_nRTS            NVT_PINMUX('D', 8, SYS_GPD_MFP2_PD8MFP_UART2_nRTS)
#define PD8MFP_UART7_RXD             NVT_PINMUX('D', 8, SYS_GPD_MFP2_PD8MFP_UART7_RXD)
#define PD8MFP_PSIO0_CH3             NVT_PINMUX('D', 8, SYS_GPD_MFP2_PD8MFP_PSIO0_CH3)
#define PD9MFP_GPIO                  NVT_PINMUX('D', 9, SYS_GPD_MFP2_PD9MFP_GPIO)
#define PD9MFP_EBI_AD7               NVT_PINMUX('D', 9, SYS_GPD_MFP2_PD9MFP_EBI_AD7)
#define PD9MFP_I2C2_SCL              NVT_PINMUX('D', 9, SYS_GPD_MFP2_PD9MFP_I2C2_SCL)
#define PD9MFP_UART2_nCTS            NVT_PINMUX('D', 9, SYS_GPD_MFP2_PD9MFP_UART2_nCTS)
#define PD9MFP_UART7_TXD             NVT_PINMUX('D', 9, SYS_GPD_MFP2_PD9MFP_UART7_TXD)
#define PD9MFP_PSIO0_CH2             NVT_PINMUX('D', 9, SYS_GPD_MFP2_PD9MFP_PSIO0_CH2)
#define PD10MFP_GPIO                 NVT_PINMUX('D', 10, SYS_GPD_MFP2_PD10MFP_GPIO)
#define PD10MFP_EADC0_CH16           NVT_PINMUX('D', 10, SYS_GPD_MFP2_PD10MFP_EADC0_CH16)
#define PD10MFP_LPADC0_CH16          NVT_PINMUX('D', 10, SYS_GPD_MFP2_PD10MFP_LPADC0_CH16)
#define PD10MFP_EBI_nCS2             NVT_PINMUX('D', 10, SYS_GPD_MFP2_PD10MFP_EBI_nCS2)
#define PD10MFP_UART1_RXD            NVT_PINMUX('D', 10, SYS_GPD_MFP2_PD10MFP_UART1_RXD)
#define PD10MFP_CANFD0_RXD           NVT_PINMUX('D', 10, SYS_GPD_MFP2_PD10MFP_CANFD0_RXD)
#define PD10MFP_UART8_RXD            NVT_PINMUX('D', 10, SYS_GPD_MFP2_PD10MFP_UART8_RXD)
#define PD10MFP_EQEI0_B              NVT_PINMUX('D', 10, SYS_GPD_MFP2_PD10MFP_EQEI0_B)
#define PD10MFP_ECAP3_IC2            NVT_PINMUX('D', 10, SYS_GPD_MFP2_PD10MFP_ECAP3_IC2)
#define PD10MFP_INT7                 NVT_PINMUX('D', 10, SYS_GPD_MFP2_PD10MFP_INT7)
#define PD11MFP_GPIO                 NVT_PINMUX('D', 11, SYS_GPD_MFP2_PD11MFP_GPIO)
#define PD11MFP_EADC0_CH17           NVT_PINMUX('D', 11, SYS_GPD_MFP2_PD11MFP_EADC0_CH17)
#define PD11MFP_LPADC0_CH17          NVT_PINMUX('D', 11, SYS_GPD_MFP2_PD11MFP_LPADC0_CH17)
#define PD11MFP_EBI_nCS1             NVT_PINMUX('D', 11, SYS_GPD_MFP2_PD11MFP_EBI_nCS1)
#define PD11MFP_UART1_TXD            NVT_PINMUX('D', 11, SYS_GPD_MFP2_PD11MFP_UART1_TXD)
#define PD11MFP_CANFD0_TXD           NVT_PINMUX('D', 11, SYS_GPD_MFP2_PD11MFP_CANFD0_TXD)
#define PD11MFP_UART8_TXD            NVT_PINMUX('D', 11, SYS_GPD_MFP2_PD11MFP_UART8_TXD)
#define PD11MFP_EQEI0_A              NVT_PINMUX('D', 11, SYS_GPD_MFP2_PD11MFP_EQEI0_A)
#define PD11MFP_ECAP3_IC1            NVT_PINMUX('D', 11, SYS_GPD_MFP2_PD11MFP_ECAP3_IC1)
#define PD11MFP_INT6                 NVT_PINMUX('D', 11, SYS_GPD_MFP2_PD11MFP_INT6)
#define PD12MFP_GPIO                 NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_GPIO)
#define PD12MFP_EADC0_CH18           NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_EADC0_CH18)
#define PD12MFP_LPADC0_CH18          NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_LPADC0_CH18)
#define PD12MFP_EBI_nCS0             NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_EBI_nCS0)
#define PD12MFP_CANFD1_RXD           NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_CANFD1_RXD)
#define PD12MFP_UART2_RXD            NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_UART2_RXD)
#define PD12MFP_UART8_nRTS           NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_UART8_nRTS)
#define PD12MFP_BPWM0_CH5            NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_BPWM0_CH5)
#define PD12MFP_EQEI0_INDEX          NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_EQEI0_INDEX)
#define PD12MFP_ECAP3_IC0            NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_ECAP3_IC0)
#define PD12MFP_CLKO                 NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_CLKO)
#define PD12MFP_EADC0_ST             NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_EADC0_ST)
#define PD12MFP_INT5                 NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_INT5)
#define PD12MFP_LPADC0_ST            NVT_PINMUX('D', 12, SYS_GPD_MFP3_PD12MFP_LPADC0_ST)
#define PD13MFP_GPIO                 NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_GPIO)
#define PD13MFP_EBI_AD10             NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_EBI_AD10)
#define PD13MFP_SD0_nCD              NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_SD0_nCD)
#define PD13MFP_SPI0_I2SMCLK         NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_SPI0_I2SMCLK)
#define PD13MFP_SPI1_I2SMCLK         NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_SPI1_I2SMCLK)
#define PD13MFP_QSPI1_MOSI0          NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_QSPI1_MOSI0)
#define PD13MFP_SC2_nCD              NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_SC2_nCD)
#define PD13MFP_SD1_CLK              NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_SD1_CLK)
#define PD13MFP_UART6_RXD            NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_UART6_RXD)
#define PD13MFP_I2S1_LRCK            NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_I2S1_LRCK)
#define PD13MFP_BPWM0_CH0            NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_BPWM0_CH0)
#define PD13MFP_EQEI2_B              NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_EQEI2_B)
#define PD13MFP_ECAP2_IC2            NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_ECAP2_IC2)
#define PD13MFP_CLKO                 NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_CLKO)
#define PD13MFP_EADC0_ST             NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_EADC0_ST)
#define PD13MFP_LPADC0_ST            NVT_PINMUX('D', 13, SYS_GPD_MFP3_PD13MFP_LPADC0_ST)
#define PD14MFP_GPIO                 NVT_PINMUX('D', 14, SYS_GPD_MFP3_PD14MFP_GPIO)
#define PD14MFP_EBI_nCS0             NVT_PINMUX('D', 14, SYS_GPD_MFP3_PD14MFP_EBI_nCS0)
#define PD14MFP_SPI3_I2SMCLK         NVT_PINMUX('D', 14, SYS_GPD_MFP3_PD14MFP_SPI3_I2SMCLK)
#define PD14MFP_SC1_nCD              NVT_PINMUX('D', 14, SYS_GPD_MFP3_PD14MFP_SC1_nCD)
#define PD14MFP_SPI0_I2SMCLK         NVT_PINMUX('D', 14, SYS_GPD_MFP3_PD14MFP_SPI0_I2SMCLK)
#define PD14MFP_QSPI0_MOSI1          NVT_PINMUX('D', 14, SYS_GPD_MFP3_PD14MFP_QSPI0_MOSI1)
#define PD14MFP_I2S1_BCLK            NVT_PINMUX('D', 14, SYS_GPD_MFP3_PD14MFP_I2S1_BCLK)
#define PD14MFP_EPWM0_CH4            NVT_PINMUX('D', 14, SYS_GPD_MFP3_PD14MFP_EPWM0_CH4)
#define PE0MFP_GPIO                  NVT_PINMUX('E', 0, SYS_GPE_MFP0_PE0MFP_GPIO)
#define PE0MFP_EBI_AD11              NVT_PINMUX('E', 0, SYS_GPE_MFP0_PE0MFP_EBI_AD11)
#define PE0MFP_QSPI0_MOSI0           NVT_PINMUX('E', 0, SYS_GPE_MFP0_PE0MFP_QSPI0_MOSI0)
#define PE0MFP_SC2_CLK               NVT_PINMUX('E', 0, SYS_GPE_MFP0_PE0MFP_SC2_CLK)
#define PE0MFP_I2S0_MCLK             NVT_PINMUX('E', 0, SYS_GPE_MFP0_PE0MFP_I2S0_MCLK)
#define PE0MFP_SPI1_MOSI             NVT_PINMUX('E', 0, SYS_GPE_MFP0_PE0MFP_SPI1_MOSI)
#define PE0MFP_UART3_RXD             NVT_PINMUX('E', 0, SYS_GPE_MFP0_PE0MFP_UART3_RXD)
#define PE0MFP_I2C1_SDA              NVT_PINMUX('E', 0, SYS_GPE_MFP0_PE0MFP_I2C1_SDA)
#define PE0MFP_UART4_nRTS            NVT_PINMUX('E', 0, SYS_GPE_MFP0_PE0MFP_UART4_nRTS)
#define PE0MFP_UART8_RXD             NVT_PINMUX('E', 0, SYS_GPE_MFP0_PE0MFP_UART8_RXD)
#define PE0MFP_LPIO0                 NVT_PINMUX('E', 0, SYS_GPE_MFP0_PE0MFP_LPIO0)
#define PE1MFP_GPIO                  NVT_PINMUX('E', 1, SYS_GPE_MFP0_PE1MFP_GPIO)
#define PE1MFP_EBI_AD10              NVT_PINMUX('E', 1, SYS_GPE_MFP0_PE1MFP_EBI_AD10)
#define PE1MFP_QSPI0_MISO0           NVT_PINMUX('E', 1, SYS_GPE_MFP0_PE1MFP_QSPI0_MISO0)
#define PE1MFP_SC2_DAT               NVT_PINMUX('E', 1, SYS_GPE_MFP0_PE1MFP_SC2_DAT)
#define PE1MFP_I2S0_BCLK             NVT_PINMUX('E', 1, SYS_GPE_MFP0_PE1MFP_I2S0_BCLK)
#define PE1MFP_SPI1_MISO             NVT_PINMUX('E', 1, SYS_GPE_MFP0_PE1MFP_SPI1_MISO)
#define PE1MFP_UART3_TXD             NVT_PINMUX('E', 1, SYS_GPE_MFP0_PE1MFP_UART3_TXD)
#define PE1MFP_I2C1_SCL              NVT_PINMUX('E', 1, SYS_GPE_MFP0_PE1MFP_I2C1_SCL)
#define PE1MFP_UART4_nCTS            NVT_PINMUX('E', 1, SYS_GPE_MFP0_PE1MFP_UART4_nCTS)
#define PE1MFP_UART8_TXD             NVT_PINMUX('E', 1, SYS_GPE_MFP0_PE1MFP_UART8_TXD)
#define PE1MFP_LPIO1                 NVT_PINMUX('E', 1, SYS_GPE_MFP0_PE1MFP_LPIO1)
#define PE2MFP_GPIO                  NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_GPIO)
#define PE2MFP_EBI_ALE               NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_EBI_ALE)
#define PE2MFP_SD0_DAT0              NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_SD0_DAT0)
#define PE2MFP_SPI3_MOSI             NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_SPI3_MOSI)
#define PE2MFP_SC0_CLK               NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_SC0_CLK)
#define PE2MFP_USCI0_CLK             NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_USCI0_CLK)
#define PE2MFP_UART6_nCTS            NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_UART6_nCTS)
#define PE2MFP_UART7_RXD             NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_UART7_RXD)
#define PE2MFP_UART8_nRTS            NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_UART8_nRTS)
#define PE2MFP_EQEI0_B               NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_EQEI0_B)
#define PE2MFP_EPWM0_CH5             NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_EPWM0_CH5)
#define PE2MFP_BPWM0_CH0             NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_BPWM0_CH0)
#define PE2MFP_I2S0_MCLK             NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_I2S0_MCLK)
#define PE2MFP_SC2_CLK               NVT_PINMUX('E', 2, SYS_GPE_MFP0_PE2MFP_SC2_CLK)
#define PE3MFP_GPIO                  NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_GPIO)
#define PE3MFP_EBI_MCLK              NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_EBI_MCLK)
#define PE3MFP_SD0_DAT1              NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_SD0_DAT1)
#define PE3MFP_SPI3_MISO             NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_SPI3_MISO)
#define PE3MFP_SC0_DAT               NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_SC0_DAT)
#define PE3MFP_USCI0_DAT0            NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_USCI0_DAT0)
#define PE3MFP_UART6_nRTS            NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_UART6_nRTS)
#define PE3MFP_UART7_TXD             NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_UART7_TXD)
#define PE3MFP_UART8_nCTS            NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_UART8_nCTS)
#define PE3MFP_EQEI0_A               NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_EQEI0_A)
#define PE3MFP_EPWM0_CH4             NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_EPWM0_CH4)
#define PE3MFP_BPWM0_CH1             NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_BPWM0_CH1)
#define PE3MFP_I2S0_BCLK             NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_I2S0_BCLK)
#define PE3MFP_SC2_DAT               NVT_PINMUX('E', 3, SYS_GPE_MFP0_PE3MFP_SC2_DAT)
#define PE4MFP_GPIO                  NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_GPIO)
#define PE4MFP_EBI_nWR               NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_EBI_nWR)
#define PE4MFP_SD0_DAT2              NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_SD0_DAT2)
#define PE4MFP_SPI3_CLK              NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_SPI3_CLK)
#define PE4MFP_SC0_RST               NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_SC0_RST)
#define PE4MFP_USCI0_DAT1            NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_USCI0_DAT1)
#define PE4MFP_UART6_RXD             NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_UART6_RXD)
#define PE4MFP_UART7_nCTS            NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_UART7_nCTS)
#define PE4MFP_UART9_RXD             NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_UART9_RXD)
#define PE4MFP_EQEI0_INDEX           NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_EQEI0_INDEX)
#define PE4MFP_EPWM0_CH3             NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_EPWM0_CH3)
#define PE4MFP_BPWM0_CH2             NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_BPWM0_CH2)
#define PE4MFP_SPI1_MOSI             NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_SPI1_MOSI)
#define PE4MFP_PSIO0_CH3             NVT_PINMUX('E', 4, SYS_GPE_MFP1_PE4MFP_PSIO0_CH3)
#define PE5MFP_GPIO                  NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_GPIO)
#define PE5MFP_EBI_nRD               NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_EBI_nRD)
#define PE5MFP_SD0_DAT3              NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_SD0_DAT3)
#define PE5MFP_SPI3_SS               NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_SPI3_SS)
#define PE5MFP_SC0_PWR               NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_SC0_PWR)
#define PE5MFP_USCI0_CTL1            NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_USCI0_CTL1)
#define PE5MFP_UART6_TXD             NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_UART6_TXD)
#define PE5MFP_UART7_nRTS            NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_UART7_nRTS)
#define PE5MFP_UART9_TXD             NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_UART9_TXD)
#define PE5MFP_EQEI1_B               NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_EQEI1_B)
#define PE5MFP_EPWM0_CH2             NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_EPWM0_CH2)
#define PE5MFP_BPWM0_CH3             NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_BPWM0_CH3)
#define PE5MFP_SPI1_MISO             NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_SPI1_MISO)
#define PE5MFP_PSIO0_CH2             NVT_PINMUX('E', 5, SYS_GPE_MFP1_PE5MFP_PSIO0_CH2)
#define PE6MFP_GPIO                  NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_GPIO)
#define PE6MFP_EBI_AD11              NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_EBI_AD11)
#define PE6MFP_SD0_CLK               NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_SD0_CLK)
#define PE6MFP_SPI3_I2SMCLK          NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_SPI3_I2SMCLK)
#define PE6MFP_SC0_nCD               NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_SC0_nCD)
#define PE6MFP_USCI0_CTL0            NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_USCI0_CTL0)
#define PE6MFP_UART5_RXD             NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_UART5_RXD)
#define PE6MFP_CANFD1_RXD            NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_CANFD1_RXD)
#define PE6MFP_UART9_nRTS            NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_UART9_nRTS)
#define PE6MFP_EQEI1_A               NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_EQEI1_A)
#define PE6MFP_EPWM0_CH1             NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_EPWM0_CH1)
#define PE6MFP_BPWM0_CH4             NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_BPWM0_CH4)
#define PE6MFP_ACMP3_O               NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_ACMP3_O)
#define PE6MFP_QSPI0_MOSI0           NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_QSPI0_MOSI0)
#define PE6MFP_PSIO0_CH1             NVT_PINMUX('E', 6, SYS_GPE_MFP1_PE6MFP_PSIO0_CH1)
#define PE7MFP_GPIO                  NVT_PINMUX('E', 7, SYS_GPE_MFP1_PE7MFP_GPIO)
#define PE7MFP_EBI_AD10              NVT_PINMUX('E', 7, SYS_GPE_MFP1_PE7MFP_EBI_AD10)
#define PE7MFP_SD0_CMD               NVT_PINMUX('E', 7, SYS_GPE_MFP1_PE7MFP_SD0_CMD)
#define PE7MFP_UART5_TXD             NVT_PINMUX('E', 7, SYS_GPE_MFP1_PE7MFP_UART5_TXD)
#define PE7MFP_CANFD1_TXD            NVT_PINMUX('E', 7, SYS_GPE_MFP1_PE7MFP_CANFD1_TXD)
#define PE7MFP_UART9_nCTS            NVT_PINMUX('E', 7, SYS_GPE_MFP1_PE7MFP_UART9_nCTS)
#define PE7MFP_EQEI1_INDEX           NVT_PINMUX('E', 7, SYS_GPE_MFP1_PE7MFP_EQEI1_INDEX)
#define PE7MFP_EPWM0_CH0             NVT_PINMUX('E', 7, SYS_GPE_MFP1_PE7MFP_EPWM0_CH0)
#define PE7MFP_BPWM0_CH5             NVT_PINMUX('E', 7, SYS_GPE_MFP1_PE7MFP_BPWM0_CH5)
#define PE7MFP_ACMP2_O               NVT_PINMUX('E', 7, SYS_GPE_MFP1_PE7MFP_ACMP2_O)
#define PE7MFP_QSPI0_MISO0           NVT_PINMUX('E', 7, SYS_GPE_MFP1_PE7MFP_QSPI0_MISO0)
#define PE7MFP_PSIO0_CH0             NVT_PINMUX('E', 7, SYS_GPE_MFP1_PE7MFP_PSIO0_CH0)
#define PE8MFP_GPIO                  NVT_PINMUX('E', 8, SYS_GPE_MFP2_PE8MFP_GPIO)
#define PE8MFP_EBI_ADR10             NVT_PINMUX('E', 8, SYS_GPE_MFP2_PE8MFP_EBI_ADR10)
#define PE8MFP_EMAC0_RMII_MDC        NVT_PINMUX('E', 8, SYS_GPE_MFP2_PE8MFP_EMAC0_RMII_MDC)
#define PE8MFP_I2S0_BCLK             NVT_PINMUX('E', 8, SYS_GPE_MFP2_PE8MFP_I2S0_BCLK)
#define PE8MFP_SPI2_CLK              NVT_PINMUX('E', 8, SYS_GPE_MFP2_PE8MFP_SPI2_CLK)
#define PE8MFP_UART2_TXD             NVT_PINMUX('E', 8, SYS_GPE_MFP2_PE8MFP_UART2_TXD)
#define PE8MFP_EPWM0_CH0             NVT_PINMUX('E', 8, SYS_GPE_MFP2_PE8MFP_EPWM0_CH0)
#define PE8MFP_EPWM0_BRAKE0          NVT_PINMUX('E', 8, SYS_GPE_MFP2_PE8MFP_EPWM0_BRAKE0)
#define PE8MFP_ECAP0_IC0             NVT_PINMUX('E', 8, SYS_GPE_MFP2_PE8MFP_ECAP0_IC0)
#define PE8MFP_EQEI2_INDEX           NVT_PINMUX('E', 8, SYS_GPE_MFP2_PE8MFP_EQEI2_INDEX)
#define PE8MFP_TRACE_DATA3           NVT_PINMUX('E', 8, SYS_GPE_MFP2_PE8MFP_TRACE_DATA3)
#define PE8MFP_ECAP3_IC0             NVT_PINMUX('E', 8, SYS_GPE_MFP2_PE8MFP_ECAP3_IC0)
#define PE8MFP_DMIC0_DAT             NVT_PINMUX('E', 8, SYS_GPE_MFP2_PE8MFP_DMIC0_DAT)
#define PE9MFP_GPIO                  NVT_PINMUX('E', 9, SYS_GPE_MFP2_PE9MFP_GPIO)
#define PE9MFP_EBI_ADR11             NVT_PINMUX('E', 9, SYS_GPE_MFP2_PE9MFP_EBI_ADR11)
#define PE9MFP_EMAC0_RMII_MDIO       NVT_PINMUX('E', 9, SYS_GPE_MFP2_PE9MFP_EMAC0_RMII_MDIO)
#define PE9MFP_I2S0_MCLK             NVT_PINMUX('E', 9, SYS_GPE_MFP2_PE9MFP_I2S0_MCLK)
#define PE9MFP_SPI2_MISO             NVT_PINMUX('E', 9, SYS_GPE_MFP2_PE9MFP_SPI2_MISO)
#define PE9MFP_UART2_RXD             NVT_PINMUX('E', 9, SYS_GPE_MFP2_PE9MFP_UART2_RXD)
#define PE9MFP_EPWM0_CH1             NVT_PINMUX('E', 9, SYS_GPE_MFP2_PE9MFP_EPWM0_CH1)
#define PE9MFP_EPWM0_BRAKE1          NVT_PINMUX('E', 9, SYS_GPE_MFP2_PE9MFP_EPWM0_BRAKE1)
#define PE9MFP_ECAP0_IC1             NVT_PINMUX('E', 9, SYS_GPE_MFP2_PE9MFP_ECAP0_IC1)
#define PE9MFP_EQEI2_A               NVT_PINMUX('E', 9, SYS_GPE_MFP2_PE9MFP_EQEI2_A)
#define PE9MFP_TRACE_DATA2           NVT_PINMUX('E', 9, SYS_GPE_MFP2_PE9MFP_TRACE_DATA2)
#define PE9MFP_ECAP3_IC1             NVT_PINMUX('E', 9, SYS_GPE_MFP2_PE9MFP_ECAP3_IC1)
#define PE9MFP_DMIC0_CLK             NVT_PINMUX('E', 9, SYS_GPE_MFP2_PE9MFP_DMIC0_CLK)
