zephyrproject-rtos/hal_nuvoton/dts/pinctrl/m55m1h2l-pinctrl.h
#define PE10MFP_GPIO                 NVT_PINMUX('E', 10, SYS_GPE_MFP2_PE10MFP_GPIO)
#define PE10MFP_EBI_ADR12            NVT_PINMUX('E', 10, SYS_GPE_MFP2_PE10MFP_EBI_ADR12)
#define PE10MFP_EMAC0_RMII_TXD0      NVT_PINMUX('E', 10, SYS_GPE_MFP2_PE10MFP_EMAC0_RMII_TXD0)
#define PE10MFP_I2S0_DI              NVT_PINMUX('E', 10, SYS_GPE_MFP2_PE10MFP_I2S0_DI)
#define PE10MFP_SPI2_MOSI            NVT_PINMUX('E', 10, SYS_GPE_MFP2_PE10MFP_SPI2_MOSI)
#define PE10MFP_UART3_TXD            NVT_PINMUX('E', 10, SYS_GPE_MFP2_PE10MFP_UART3_TXD)
#define PE10MFP_EPWM0_CH2            NVT_PINMUX('E', 10, SYS_GPE_MFP2_PE10MFP_EPWM0_CH2)
#define PE10MFP_EPWM1_BRAKE0         NVT_PINMUX('E', 10, SYS_GPE_MFP2_PE10MFP_EPWM1_BRAKE0)
#define PE10MFP_ECAP0_IC2            NVT_PINMUX('E', 10, SYS_GPE_MFP2_PE10MFP_ECAP0_IC2)
#define PE10MFP_EQEI2_B              NVT_PINMUX('E', 10, SYS_GPE_MFP2_PE10MFP_EQEI2_B)
#define PE10MFP_TRACE_DATA1          NVT_PINMUX('E', 10, SYS_GPE_MFP2_PE10MFP_TRACE_DATA1)
#define PE10MFP_ECAP3_IC2            NVT_PINMUX('E', 10, SYS_GPE_MFP2_PE10MFP_ECAP3_IC2)
#define PE10MFP_DMIC0_CLKLP          NVT_PINMUX('E', 10, SYS_GPE_MFP2_PE10MFP_DMIC0_CLKLP)
#define PE11MFP_GPIO                 NVT_PINMUX('E', 11, SYS_GPE_MFP2_PE11MFP_GPIO)
#define PE11MFP_EBI_ADR13            NVT_PINMUX('E', 11, SYS_GPE_MFP2_PE11MFP_EBI_ADR13)
#define PE11MFP_EMAC0_RMII_TXD1      NVT_PINMUX('E', 11, SYS_GPE_MFP2_PE11MFP_EMAC0_RMII_TXD1)
#define PE11MFP_I2S0_DO              NVT_PINMUX('E', 11, SYS_GPE_MFP2_PE11MFP_I2S0_DO)
#define PE11MFP_SPI2_SS              NVT_PINMUX('E', 11, SYS_GPE_MFP2_PE11MFP_SPI2_SS)
#define PE11MFP_UART3_RXD            NVT_PINMUX('E', 11, SYS_GPE_MFP2_PE11MFP_UART3_RXD)
#define PE11MFP_UART1_nCTS           NVT_PINMUX('E', 11, SYS_GPE_MFP2_PE11MFP_UART1_nCTS)
#define PE11MFP_EPWM0_CH3            NVT_PINMUX('E', 11, SYS_GPE_MFP2_PE11MFP_EPWM0_CH3)
#define PE11MFP_EPWM1_BRAKE1         NVT_PINMUX('E', 11, SYS_GPE_MFP2_PE11MFP_EPWM1_BRAKE1)
#define PE11MFP_ECAP1_IC2            NVT_PINMUX('E', 11, SYS_GPE_MFP2_PE11MFP_ECAP1_IC2)
#define PE11MFP_TRACE_DATA0          NVT_PINMUX('E', 11, SYS_GPE_MFP2_PE11MFP_TRACE_DATA0)
#define PE11MFP_DMIC1_DAT            NVT_PINMUX('E', 11, SYS_GPE_MFP2_PE11MFP_DMIC1_DAT)
#define PE11MFP_KPI_COL7             NVT_PINMUX('E', 11, SYS_GPE_MFP2_PE11MFP_KPI_COL7)
#define PE12MFP_GPIO                 NVT_PINMUX('E', 12, SYS_GPE_MFP3_PE12MFP_GPIO)
#define PE12MFP_EBI_ADR14            NVT_PINMUX('E', 12, SYS_GPE_MFP3_PE12MFP_EBI_ADR14)
#define PE12MFP_EMAC0_RMII_TXEN      NVT_PINMUX('E', 12, SYS_GPE_MFP3_PE12MFP_EMAC0_RMII_TXEN)
#define PE12MFP_I2S0_LRCK            NVT_PINMUX('E', 12, SYS_GPE_MFP3_PE12MFP_I2S0_LRCK)
#define PE12MFP_SPI2_I2SMCLK         NVT_PINMUX('E', 12, SYS_GPE_MFP3_PE12MFP_SPI2_I2SMCLK)
#define PE12MFP_UART1_nRTS           NVT_PINMUX('E', 12, SYS_GPE_MFP3_PE12MFP_UART1_nRTS)
#define PE12MFP_EPWM0_CH4            NVT_PINMUX('E', 12, SYS_GPE_MFP3_PE12MFP_EPWM0_CH4)
#define PE12MFP_ECAP1_IC1            NVT_PINMUX('E', 12, SYS_GPE_MFP3_PE12MFP_ECAP1_IC1)
#define PE12MFP_TRACE_CLK            NVT_PINMUX('E', 12, SYS_GPE_MFP3_PE12MFP_TRACE_CLK)
#define PE12MFP_DMIC1_CLK            NVT_PINMUX('E', 12, SYS_GPE_MFP3_PE12MFP_DMIC1_CLK)
#define PE12MFP_KPI_COL6             NVT_PINMUX('E', 12, SYS_GPE_MFP3_PE12MFP_KPI_COL6)
#define PE13MFP_GPIO                 NVT_PINMUX('E', 13, SYS_GPE_MFP3_PE13MFP_GPIO)
#define PE13MFP_EBI_ADR15            NVT_PINMUX('E', 13, SYS_GPE_MFP3_PE13MFP_EBI_ADR15)
#define PE13MFP_EMAC0_PPS            NVT_PINMUX('E', 13, SYS_GPE_MFP3_PE13MFP_EMAC0_PPS)
#define PE13MFP_I2C0_SCL             NVT_PINMUX('E', 13, SYS_GPE_MFP3_PE13MFP_I2C0_SCL)
#define PE13MFP_UART4_nRTS           NVT_PINMUX('E', 13, SYS_GPE_MFP3_PE13MFP_UART4_nRTS)
#define PE13MFP_UART1_TXD            NVT_PINMUX('E', 13, SYS_GPE_MFP3_PE13MFP_UART1_TXD)
#define PE13MFP_EPWM0_CH5            NVT_PINMUX('E', 13, SYS_GPE_MFP3_PE13MFP_EPWM0_CH5)
#define PE13MFP_EPWM1_CH0            NVT_PINMUX('E', 13, SYS_GPE_MFP3_PE13MFP_EPWM1_CH0)
#define PE13MFP_BPWM1_CH5            NVT_PINMUX('E', 13, SYS_GPE_MFP3_PE13MFP_BPWM1_CH5)
#define PE13MFP_ECAP1_IC0            NVT_PINMUX('E', 13, SYS_GPE_MFP3_PE13MFP_ECAP1_IC0)
#define PE13MFP_TRACE_SWO            NVT_PINMUX('E', 13, SYS_GPE_MFP3_PE13MFP_TRACE_SWO)
#define PE13MFP_KPI_COL5             NVT_PINMUX('E', 13, SYS_GPE_MFP3_PE13MFP_KPI_COL5)
#define PE13MFP_LPI2C0_SCL           NVT_PINMUX('E', 13, SYS_GPE_MFP3_PE13MFP_LPI2C0_SCL)
#define PE14MFP_GPIO                 NVT_PINMUX('E', 14, SYS_GPE_MFP3_PE14MFP_GPIO)
#define PE14MFP_EBI_AD8              NVT_PINMUX('E', 14, SYS_GPE_MFP3_PE14MFP_EBI_AD8)
#define PE14MFP_UART2_TXD            NVT_PINMUX('E', 14, SYS_GPE_MFP3_PE14MFP_UART2_TXD)
#define PE14MFP_CANFD0_TXD           NVT_PINMUX('E', 14, SYS_GPE_MFP3_PE14MFP_CANFD0_TXD)
#define PE14MFP_SD1_nCD              NVT_PINMUX('E', 14, SYS_GPE_MFP3_PE14MFP_SD1_nCD)
#define PE14MFP_UART6_TXD            NVT_PINMUX('E', 14, SYS_GPE_MFP3_PE14MFP_UART6_TXD)
#define PE14MFP_UART3_TXD            NVT_PINMUX('E', 14, SYS_GPE_MFP3_PE14MFP_UART3_TXD)
#define PE14MFP_I2C1_SCL             NVT_PINMUX('E', 14, SYS_GPE_MFP3_PE14MFP_I2C1_SCL)
#define PE14MFP_UART4_nCTS           NVT_PINMUX('E', 14, SYS_GPE_MFP3_PE14MFP_UART4_nCTS)
#define PE14MFP_UART8_TXD            NVT_PINMUX('E', 14, SYS_GPE_MFP3_PE14MFP_UART8_TXD)
#define PE14MFP_PSIO0_CH0            NVT_PINMUX('E', 14, SYS_GPE_MFP3_PE14MFP_PSIO0_CH0)
#define PE15MFP_GPIO                 NVT_PINMUX('E', 15, SYS_GPE_MFP3_PE15MFP_GPIO)
#define PE15MFP_EBI_AD9              NVT_PINMUX('E', 15, SYS_GPE_MFP3_PE15MFP_EBI_AD9)
#define PE15MFP_UART2_RXD            NVT_PINMUX('E', 15, SYS_GPE_MFP3_PE15MFP_UART2_RXD)
#define PE15MFP_CANFD0_RXD           NVT_PINMUX('E', 15, SYS_GPE_MFP3_PE15MFP_CANFD0_RXD)
#define PE15MFP_UART6_RXD            NVT_PINMUX('E', 15, SYS_GPE_MFP3_PE15MFP_UART6_RXD)
#define PE15MFP_UART3_RXD            NVT_PINMUX('E', 15, SYS_GPE_MFP3_PE15MFP_UART3_RXD)
#define PE15MFP_I2C1_SDA             NVT_PINMUX('E', 15, SYS_GPE_MFP3_PE15MFP_I2C1_SDA)
#define PE15MFP_UART4_nRTS           NVT_PINMUX('E', 15, SYS_GPE_MFP3_PE15MFP_UART4_nRTS)
#define PE15MFP_UART8_RXD            NVT_PINMUX('E', 15, SYS_GPE_MFP3_PE15MFP_UART8_RXD)
#define PE15MFP_PSIO0_CH1            NVT_PINMUX('E', 15, SYS_GPE_MFP3_PE15MFP_PSIO0_CH1)
#define PF0MFP_GPIO                  NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_GPIO)
#define PF0MFP_UART1_TXD             NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_UART1_TXD)
#define PF0MFP_I2C1_SCL              NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_I2C1_SCL)
#define PF0MFP_UART0_TXD             NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_UART0_TXD)
#define PF0MFP_SC1_DAT               NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_SC1_DAT)
#define PF0MFP_I2S0_DO               NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_I2S0_DO)
#define PF0MFP_USCI0_CTL1            NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_USCI0_CTL1)
#define PF0MFP_UART2_TXD             NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_UART2_TXD)
#define PF0MFP_I2C0_SCL              NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_I2C0_SCL)
#define PF0MFP_EPWM1_CH4             NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_EPWM1_CH4)
#define PF0MFP_BPWM1_CH0             NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_BPWM1_CH0)
#define PF0MFP_ACMP0_O               NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_ACMP0_O)
#define PF0MFP_ICE_DAT               NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_ICE_DAT)
#define PF0MFP_EADC0_ST              NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_EADC0_ST)
#define PF0MFP_I3C0_SCL              NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_I3C0_SCL)
#define PF0MFP_UTCPD0_FRSTX2         NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_UTCPD0_FRSTX2)
#define PF0MFP_UTCPD0_DISCHG         NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_UTCPD0_DISCHG)
#define PF0MFP_LPUART0_TXD           NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_LPUART0_TXD)
#define PF0MFP_LPADC0_ST             NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_LPADC0_ST)
#define PF0MFP_LPIO2                 NVT_PINMUX('F', 0, SYS_GPF_MFP0_PF0MFP_LPIO2)
#define PF1MFP_GPIO                  NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_GPIO)
#define PF1MFP_UART1_RXD             NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_UART1_RXD)
#define PF1MFP_I2C1_SDA              NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_I2C1_SDA)
#define PF1MFP_UART0_RXD             NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_UART0_RXD)
#define PF1MFP_SC1_CLK               NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_SC1_CLK)
#define PF1MFP_I2S0_LRCK             NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_I2S0_LRCK)
#define PF1MFP_USCI0_DAT1            NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_USCI0_DAT1)
#define PF1MFP_UART2_RXD             NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_UART2_RXD)
#define PF1MFP_I2C0_SDA              NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_I2C0_SDA)
#define PF1MFP_EPWM1_CH5             NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_EPWM1_CH5)
#define PF1MFP_BPWM1_CH1             NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_BPWM1_CH1)
#define PF1MFP_ACMP1_O               NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_ACMP1_O)
#define PF1MFP_ICE_CLK               NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_ICE_CLK)
#define PF1MFP_I3C0_SDA              NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_I3C0_SDA)
#define PF1MFP_UTCPD0_FRSTX1         NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_UTCPD0_FRSTX1)
#define PF1MFP_UTCPD0_DISCHG         NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_UTCPD0_DISCHG)
#define PF1MFP_LPUART0_RXD           NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_LPUART0_RXD)
#define PF1MFP_LPIO3                 NVT_PINMUX('F', 1, SYS_GPF_MFP0_PF1MFP_LPIO3)
#define PF2MFP_GPIO                  NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_GPIO)
#define PF2MFP_EBI_nCS1              NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_EBI_nCS1)
#define PF2MFP_UART0_RXD             NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_UART0_RXD)
#define PF2MFP_I2C0_SDA              NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_I2C0_SDA)
#define PF2MFP_QSPI0_CLK             NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_QSPI0_CLK)
#define PF2MFP_UART9_RXD             NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_UART9_RXD)
#define PF2MFP_I2C2_SMBSUS           NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_I2C2_SMBSUS)
#define PF2MFP_EPWM1_CH1             NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_EPWM1_CH1)
#define PF2MFP_XT1_OUT               NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_XT1_OUT)
#define PF2MFP_BPWM1_CH1             NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_BPWM1_CH1)
#define PF2MFP_ACMP3_O               NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_ACMP3_O)
#define PF2MFP_SC1_RST               NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_SC1_RST)
#define PF2MFP_TM1_EXT               NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_TM1_EXT)
#define PF2MFP_LPUART0_RXD           NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_LPUART0_RXD)
#define PF2MFP_LPI2C0_SDA            NVT_PINMUX('F', 2, SYS_GPF_MFP0_PF2MFP_LPI2C0_SDA)
#define PF3MFP_GPIO                  NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_GPIO)
#define PF3MFP_EBI_nCS0              NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_EBI_nCS0)
#define PF3MFP_UART0_TXD             NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_UART0_TXD)
#define PF3MFP_I2C0_SCL              NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_I2C0_SCL)
#define PF3MFP_UART9_TXD             NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_UART9_TXD)
#define PF3MFP_I2C2_SMBAL            NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_I2C2_SMBAL)
#define PF3MFP_EPWM1_CH0             NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_EPWM1_CH0)
#define PF3MFP_XT1_IN                NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_XT1_IN)
#define PF3MFP_BPWM1_CH0             NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_BPWM1_CH0)
#define PF3MFP_ACMP2_O               NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_ACMP2_O)
#define PF3MFP_SC1_PWR               NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_SC1_PWR)
#define PF3MFP_TM0_EXT               NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_TM0_EXT)
#define PF3MFP_LPUART0_TXD           NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_LPUART0_TXD)
#define PF3MFP_LPI2C0_SCL            NVT_PINMUX('F', 3, SYS_GPF_MFP0_PF3MFP_LPI2C0_SCL)
#define PF4MFP_GPIO                  NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_GPIO)
#define PF4MFP_UART2_TXD             NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_UART2_TXD)
#define PF4MFP_EBI_AD0               NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_EBI_AD0)
#define PF4MFP_UART2_nRTS            NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_UART2_nRTS)
#define PF4MFP_UART0_nRTS            NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_UART0_nRTS)
#define PF4MFP_UART3_RXD             NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_UART3_RXD)
#define PF4MFP_EPWM0_CH1             NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_EPWM0_CH1)
#define PF4MFP_BPWM0_CH5             NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_BPWM0_CH5)
#define PF4MFP_X32_OUT               NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_X32_OUT)
#define PF4MFP_EQEI2_B               NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_EQEI2_B)
#define PF4MFP_PSIO0_CH1             NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_PSIO0_CH1)
#define PF4MFP_KPI_COL1              NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_KPI_COL1)
#define PF4MFP_SWODEC_SWO            NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_SWODEC_SWO)
#define PF4MFP_UTCPD0_VBSRCEN        NVT_PINMUX('F', 4, SYS_GPF_MFP1_PF4MFP_UTCPD0_VBSRCEN)
#define PF5MFP_GPIO                  NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_GPIO)
#define PF5MFP_UART2_RXD             NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_UART2_RXD)
#define PF5MFP_EBI_AD1               NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_EBI_AD1)
#define PF5MFP_UART2_nCTS            NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_UART2_nCTS)
#define PF5MFP_UART0_nCTS            NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_UART0_nCTS)
#define PF5MFP_UART3_TXD             NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_UART3_TXD)
#define PF5MFP_EPWM0_CH0             NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_EPWM0_CH0)
#define PF5MFP_BPWM0_CH4             NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_BPWM0_CH4)
#define PF5MFP_EPWM0_SYNC_OUT        NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_EPWM0_SYNC_OUT)
#define PF5MFP_X32_IN                NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_X32_IN)
#define PF5MFP_EADC0_ST              NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_EADC0_ST)
#define PF5MFP_EQEI2_A               NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_EQEI2_A)
#define PF5MFP_PSIO0_CH0             NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_PSIO0_CH0)
#define PF5MFP_KPI_COL0              NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_KPI_COL0)
#define PF5MFP_UTCPD0_VBSNKEN        NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_UTCPD0_VBSNKEN)
#define PF5MFP_LPADC0_ST             NVT_PINMUX('F', 5, SYS_GPF_MFP1_PF5MFP_LPADC0_ST)
#define PF6MFP_GPIO                  NVT_PINMUX('F', 6, SYS_GPF_MFP1_PF6MFP_GPIO)
#define PF6MFP_EBI_ADR19             NVT_PINMUX('F', 6, SYS_GPF_MFP1_PF6MFP_EBI_ADR19)
#define PF6MFP_SC0_CLK               NVT_PINMUX('F', 6, SYS_GPF_MFP1_PF6MFP_SC0_CLK)
#define PF6MFP_I2S0_LRCK             NVT_PINMUX('F', 6, SYS_GPF_MFP1_PF6MFP_I2S0_LRCK)
#define PF6MFP_SPI0_MOSI             NVT_PINMUX('F', 6, SYS_GPF_MFP1_PF6MFP_SPI0_MOSI)
#define PF6MFP_UART4_RXD             NVT_PINMUX('F', 6, SYS_GPF_MFP1_PF6MFP_UART4_RXD)
#define PF6MFP_EBI_nCS0              NVT_PINMUX('F', 6, SYS_GPF_MFP1_PF6MFP_EBI_nCS0)
#define PF6MFP_SPI3_I2SMCLK          NVT_PINMUX('F', 6, SYS_GPF_MFP1_PF6MFP_SPI3_I2SMCLK)
#define PF6MFP_TAMPER0               NVT_PINMUX('F', 6, SYS_GPF_MFP1_PF6MFP_TAMPER0)
#define PF6MFP_EQEI2_INDEX           NVT_PINMUX('F', 6, SYS_GPF_MFP1_PF6MFP_EQEI2_INDEX)
#define PF6MFP_TRACE_SWO             NVT_PINMUX('F', 6, SYS_GPF_MFP1_PF6MFP_TRACE_SWO)
#define PF7MFP_GPIO                  NVT_PINMUX('F', 7, SYS_GPF_MFP1_PF7MFP_GPIO)
#define PF7MFP_EBI_ADR18             NVT_PINMUX('F', 7, SYS_GPF_MFP1_PF7MFP_EBI_ADR18)
#define PF7MFP_SC0_DAT               NVT_PINMUX('F', 7, SYS_GPF_MFP1_PF7MFP_SC0_DAT)
#define PF7MFP_I2S0_DO               NVT_PINMUX('F', 7, SYS_GPF_MFP1_PF7MFP_I2S0_DO)
#define PF7MFP_SPI0_MISO             NVT_PINMUX('F', 7, SYS_GPF_MFP1_PF7MFP_SPI0_MISO)
#define PF7MFP_UART4_TXD             NVT_PINMUX('F', 7, SYS_GPF_MFP1_PF7MFP_UART4_TXD)
#define PF7MFP_CCAP_DATA0            NVT_PINMUX('F', 7, SYS_GPF_MFP1_PF7MFP_CCAP_DATA0)
#define PF7MFP_TAMPER1               NVT_PINMUX('F', 7, SYS_GPF_MFP1_PF7MFP_TAMPER1)
#define PF8MFP_GPIO                  NVT_PINMUX('F', 8, SYS_GPF_MFP2_PF8MFP_GPIO)
#define PF8MFP_EBI_ADR17             NVT_PINMUX('F', 8, SYS_GPF_MFP2_PF8MFP_EBI_ADR17)
#define PF8MFP_SC0_RST               NVT_PINMUX('F', 8, SYS_GPF_MFP2_PF8MFP_SC0_RST)
#define PF8MFP_I2S0_DI               NVT_PINMUX('F', 8, SYS_GPF_MFP2_PF8MFP_I2S0_DI)
#define PF8MFP_SPI0_CLK              NVT_PINMUX('F', 8, SYS_GPF_MFP2_PF8MFP_SPI0_CLK)
#define PF8MFP_UART5_nCTS            NVT_PINMUX('F', 8, SYS_GPF_MFP2_PF8MFP_UART5_nCTS)
#define PF8MFP_CCAP_DATA1            NVT_PINMUX('F', 8, SYS_GPF_MFP2_PF8MFP_CCAP_DATA1)
#define PF8MFP_CANFD1_RXD            NVT_PINMUX('F', 8, SYS_GPF_MFP2_PF8MFP_CANFD1_RXD)
#define PF8MFP_TAMPER2               NVT_PINMUX('F', 8, SYS_GPF_MFP2_PF8MFP_TAMPER2)
#define PF8MFP_UART9_RXD             NVT_PINMUX('F', 8, SYS_GPF_MFP2_PF8MFP_UART9_RXD)
#define PF9MFP_GPIO                  NVT_PINMUX('F', 9, SYS_GPF_MFP2_PF9MFP_GPIO)
#define PF9MFP_EBI_ADR16             NVT_PINMUX('F', 9, SYS_GPF_MFP2_PF9MFP_EBI_ADR16)
#define PF9MFP_SC0_PWR               NVT_PINMUX('F', 9, SYS_GPF_MFP2_PF9MFP_SC0_PWR)
#define PF9MFP_I2S0_MCLK             NVT_PINMUX('F', 9, SYS_GPF_MFP2_PF9MFP_I2S0_MCLK)
#define PF9MFP_SPI0_SS               NVT_PINMUX('F', 9, SYS_GPF_MFP2_PF9MFP_SPI0_SS)
#define PF9MFP_UART5_nRTS            NVT_PINMUX('F', 9, SYS_GPF_MFP2_PF9MFP_UART5_nRTS)
#define PF9MFP_CCAP_DATA2            NVT_PINMUX('F', 9, SYS_GPF_MFP2_PF9MFP_CCAP_DATA2)
#define PF9MFP_CANFD1_TXD            NVT_PINMUX('F', 9, SYS_GPF_MFP2_PF9MFP_CANFD1_TXD)
#define PF9MFP_TAMPER3               NVT_PINMUX('F', 9, SYS_GPF_MFP2_PF9MFP_TAMPER3)
#define PF9MFP_UART9_TXD             NVT_PINMUX('F', 9, SYS_GPF_MFP2_PF9MFP_UART9_TXD)
#define PF10MFP_GPIO                 NVT_PINMUX('F', 10, SYS_GPF_MFP2_PF10MFP_GPIO)
#define PF10MFP_EBI_ADR15            NVT_PINMUX('F', 10, SYS_GPF_MFP2_PF10MFP_EBI_ADR15)
#define PF10MFP_SC0_nCD              NVT_PINMUX('F', 10, SYS_GPF_MFP2_PF10MFP_SC0_nCD)
#define PF10MFP_I2S0_BCLK            NVT_PINMUX('F', 10, SYS_GPF_MFP2_PF10MFP_I2S0_BCLK)
#define PF10MFP_SPI0_I2SMCLK         NVT_PINMUX('F', 10, SYS_GPF_MFP2_PF10MFP_SPI0_I2SMCLK)
#define PF10MFP_UART5_RXD            NVT_PINMUX('F', 10, SYS_GPF_MFP2_PF10MFP_UART5_RXD)
#define PF10MFP_CCAP_DATA3           NVT_PINMUX('F', 10, SYS_GPF_MFP2_PF10MFP_CCAP_DATA3)
#define PF10MFP_TAMPER4              NVT_PINMUX('F', 10, SYS_GPF_MFP2_PF10MFP_TAMPER4)
#define PF10MFP_UART9_nRTS           NVT_PINMUX('F', 10, SYS_GPF_MFP2_PF10MFP_UART9_nRTS)
#define PF11MFP_GPIO                 NVT_PINMUX('F', 11, SYS_GPF_MFP2_PF11MFP_GPIO)
#define PF11MFP_EBI_ADR14            NVT_PINMUX('F', 11, SYS_GPF_MFP2_PF11MFP_EBI_ADR14)
#define PF11MFP_SPI2_MOSI            NVT_PINMUX('F', 11, SYS_GPF_MFP2_PF11MFP_SPI2_MOSI)
#define PF11MFP_UART5_TXD            NVT_PINMUX('F', 11, SYS_GPF_MFP2_PF11MFP_UART5_TXD)
#define PF11MFP_CCAP_DATA4           NVT_PINMUX('F', 11, SYS_GPF_MFP2_PF11MFP_CCAP_DATA4)
#define PF11MFP_TAMPER5              NVT_PINMUX('F', 11, SYS_GPF_MFP2_PF11MFP_TAMPER5)
#define PF11MFP_UART9_nCTS           NVT_PINMUX('F', 11, SYS_GPF_MFP2_PF11MFP_UART9_nCTS)
#define PF11MFP_TM3                  NVT_PINMUX('F', 11, SYS_GPF_MFP2_PF11MFP_TM3)
#define PG0MFP_GPIO                  NVT_PINMUX('G', 0, SYS_GPG_MFP0_PG0MFP_GPIO)
#define PG0MFP_EBI_ADR8              NVT_PINMUX('G', 0, SYS_GPG_MFP0_PG0MFP_EBI_ADR8)
#define PG0MFP_I2C0_SCL              NVT_PINMUX('G', 0, SYS_GPG_MFP0_PG0MFP_I2C0_SCL)
#define PG0MFP_I2C1_SMBAL            NVT_PINMUX('G', 0, SYS_GPG_MFP0_PG0MFP_I2C1_SMBAL)
#define PG0MFP_UART2_RXD             NVT_PINMUX('G', 0, SYS_GPG_MFP0_PG0MFP_UART2_RXD)
#define PG0MFP_CANFD1_TXD            NVT_PINMUX('G', 0, SYS_GPG_MFP0_PG0MFP_CANFD1_TXD)
#define PG0MFP_UART1_TXD             NVT_PINMUX('G', 0, SYS_GPG_MFP0_PG0MFP_UART1_TXD)
#define PG0MFP_I2C3_SCL              NVT_PINMUX('G', 0, SYS_GPG_MFP0_PG0MFP_I2C3_SCL)
#define PG0MFP_I2S1_DO               NVT_PINMUX('G', 0, SYS_GPG_MFP0_PG0MFP_I2S1_DO)
#define PG0MFP_EPWM0_CH1             NVT_PINMUX('G', 0, SYS_GPG_MFP0_PG0MFP_EPWM0_CH1)
#define PG0MFP_CCAP_PIXCLK           NVT_PINMUX('G', 0, SYS_GPG_MFP0_PG0MFP_CCAP_PIXCLK)
#define PG1MFP_GPIO                  NVT_PINMUX('G', 1, SYS_GPG_MFP0_PG1MFP_GPIO)
#define PG1MFP_EBI_ADR9              NVT_PINMUX('G', 1, SYS_GPG_MFP0_PG1MFP_EBI_ADR9)
#define PG1MFP_SPI2_I2SMCLK          NVT_PINMUX('G', 1, SYS_GPG_MFP0_PG1MFP_SPI2_I2SMCLK)
#define PG1MFP_I2C0_SDA              NVT_PINMUX('G', 1, SYS_GPG_MFP0_PG1MFP_I2C0_SDA)
#define PG1MFP_I2C1_SMBSUS           NVT_PINMUX('G', 1, SYS_GPG_MFP0_PG1MFP_I2C1_SMBSUS)
#define PG1MFP_UART2_TXD             NVT_PINMUX('G', 1, SYS_GPG_MFP0_PG1MFP_UART2_TXD)
#define PG1MFP_CANFD1_RXD            NVT_PINMUX('G', 1, SYS_GPG_MFP0_PG1MFP_CANFD1_RXD)
#define PG1MFP_UART1_RXD             NVT_PINMUX('G', 1, SYS_GPG_MFP0_PG1MFP_UART1_RXD)
#define PG1MFP_I2C3_SDA              NVT_PINMUX('G', 1, SYS_GPG_MFP0_PG1MFP_I2C3_SDA)
#define PG1MFP_I2S1_LRCK             NVT_PINMUX('G', 1, SYS_GPG_MFP0_PG1MFP_I2S1_LRCK)
#define PG1MFP_EPWM0_CH0             NVT_PINMUX('G', 1, SYS_GPG_MFP0_PG1MFP_EPWM0_CH0)
#define PG1MFP_CCAP_SCLK             NVT_PINMUX('G', 1, SYS_GPG_MFP0_PG1MFP_CCAP_SCLK)
#define PG2MFP_GPIO                  NVT_PINMUX('G', 2, SYS_GPG_MFP0_PG2MFP_GPIO)
#define PG2MFP_EBI_ADR11             NVT_PINMUX('G', 2, SYS_GPG_MFP0_PG2MFP_EBI_ADR11)
#define PG2MFP_SPI2_SS               NVT_PINMUX('G', 2, SYS_GPG_MFP0_PG2MFP_SPI2_SS)
#define PG2MFP_I2C0_SMBAL            NVT_PINMUX('G', 2, SYS_GPG_MFP0_PG2MFP_I2C0_SMBAL)
#define PG2MFP_I2C1_SCL              NVT_PINMUX('G', 2, SYS_GPG_MFP0_PG2MFP_I2C1_SCL)
#define PG2MFP_CCAP_DATA7            NVT_PINMUX('G', 2, SYS_GPG_MFP0_PG2MFP_CCAP_DATA7)
#define PG2MFP_I2C3_SMBAL            NVT_PINMUX('G', 2, SYS_GPG_MFP0_PG2MFP_I2C3_SMBAL)
#define PG2MFP_SC1_nCD               NVT_PINMUX('G', 2, SYS_GPG_MFP0_PG2MFP_SC1_nCD)
#define PG2MFP_SPI0_I2SMCLK          NVT_PINMUX('G', 2, SYS_GPG_MFP0_PG2MFP_SPI0_I2SMCLK)
#define PG2MFP_TM0                   NVT_PINMUX('G', 2, SYS_GPG_MFP0_PG2MFP_TM0)
#define PG2MFP_LPTM0                 NVT_PINMUX('G', 2, SYS_GPG_MFP0_PG2MFP_LPTM0)
#define PG3MFP_GPIO                  NVT_PINMUX('G', 3, SYS_GPG_MFP0_PG3MFP_GPIO)
#define PG3MFP_EBI_ADR12             NVT_PINMUX('G', 3, SYS_GPG_MFP0_PG3MFP_EBI_ADR12)
#define PG3MFP_SPI2_CLK              NVT_PINMUX('G', 3, SYS_GPG_MFP0_PG3MFP_SPI2_CLK)
#define PG3MFP_I2C0_SMBSUS           NVT_PINMUX('G', 3, SYS_GPG_MFP0_PG3MFP_I2C0_SMBSUS)
#define PG3MFP_I2C1_SDA              NVT_PINMUX('G', 3, SYS_GPG_MFP0_PG3MFP_I2C1_SDA)
#define PG3MFP_CCAP_DATA6            NVT_PINMUX('G', 3, SYS_GPG_MFP0_PG3MFP_CCAP_DATA6)
#define PG3MFP_I2C3_SMBSUS           NVT_PINMUX('G', 3, SYS_GPG_MFP0_PG3MFP_I2C3_SMBSUS)
#define PG3MFP_UART4_RXD             NVT_PINMUX('G', 3, SYS_GPG_MFP0_PG3MFP_UART4_RXD)
#define PG3MFP_UART0_RXD             NVT_PINMUX('G', 3, SYS_GPG_MFP0_PG3MFP_UART0_RXD)
#define PG3MFP_TM1                   NVT_PINMUX('G', 3, SYS_GPG_MFP0_PG3MFP_TM1)
#define PG3MFP_LPTM1                 NVT_PINMUX('G', 3, SYS_GPG_MFP0_PG3MFP_LPTM1)
#define PG4MFP_GPIO                  NVT_PINMUX('G', 4, SYS_GPG_MFP1_PG4MFP_GPIO)
#define PG4MFP_EBI_ADR13             NVT_PINMUX('G', 4, SYS_GPG_MFP1_PG4MFP_EBI_ADR13)
#define PG4MFP_SPI2_MISO             NVT_PINMUX('G', 4, SYS_GPG_MFP1_PG4MFP_SPI2_MISO)
#define PG4MFP_CCAP_DATA5            NVT_PINMUX('G', 4, SYS_GPG_MFP1_PG4MFP_CCAP_DATA5)
#define PG4MFP_TM2                   NVT_PINMUX('G', 4, SYS_GPG_MFP1_PG4MFP_TM2)
#define PG5MFP_GPIO                  NVT_PINMUX('G', 5, SYS_GPG_MFP1_PG5MFP_GPIO)
