zephyrproject-rtos/hal_nuvoton/dts/pinctrl/m55m1h2l-pinctrl.h
#define PG5MFP_EBI_nCS1              NVT_PINMUX('G', 5, SYS_GPG_MFP1_PG5MFP_EBI_nCS1)
#define PG5MFP_SPI3_SS               NVT_PINMUX('G', 5, SYS_GPG_MFP1_PG5MFP_SPI3_SS)
#define PG5MFP_SC1_PWR               NVT_PINMUX('G', 5, SYS_GPG_MFP1_PG5MFP_SC1_PWR)
#define PG5MFP_EBI_nWRL              NVT_PINMUX('G', 5, SYS_GPG_MFP1_PG5MFP_EBI_nWRL)
#define PG5MFP_I2C3_SMBAL            NVT_PINMUX('G', 5, SYS_GPG_MFP1_PG5MFP_I2C3_SMBAL)
#define PG5MFP_I2S1_MCLK             NVT_PINMUX('G', 5, SYS_GPG_MFP1_PG5MFP_I2S1_MCLK)
#define PG5MFP_EPWM0_CH3             NVT_PINMUX('G', 5, SYS_GPG_MFP1_PG5MFP_EPWM0_CH3)
#define PG6MFP_GPIO                  NVT_PINMUX('G', 6, SYS_GPG_MFP1_PG6MFP_GPIO)
#define PG6MFP_EBI_nCS2              NVT_PINMUX('G', 6, SYS_GPG_MFP1_PG6MFP_EBI_nCS2)
#define PG6MFP_SPI3_CLK              NVT_PINMUX('G', 6, SYS_GPG_MFP1_PG6MFP_SPI3_CLK)
#define PG6MFP_SC1_RST               NVT_PINMUX('G', 6, SYS_GPG_MFP1_PG6MFP_SC1_RST)
#define PG6MFP_EBI_nWRH              NVT_PINMUX('G', 6, SYS_GPG_MFP1_PG6MFP_EBI_nWRH)
#define PG6MFP_I2C3_SMBSUS           NVT_PINMUX('G', 6, SYS_GPG_MFP1_PG6MFP_I2C3_SMBSUS)
#define PG6MFP_I2S1_DI               NVT_PINMUX('G', 6, SYS_GPG_MFP1_PG6MFP_I2S1_DI)
#define PG6MFP_EPWM0_CH2             NVT_PINMUX('G', 6, SYS_GPG_MFP1_PG6MFP_EPWM0_CH2)
#define PG9MFP_GPIO                  NVT_PINMUX('G', 9, SYS_GPG_MFP2_PG9MFP_GPIO)
#define PG9MFP_EBI_AD0               NVT_PINMUX('G', 9, SYS_GPG_MFP2_PG9MFP_EBI_AD0)
#define PG9MFP_SD1_DAT3              NVT_PINMUX('G', 9, SYS_GPG_MFP2_PG9MFP_SD1_DAT3)
#define PG9MFP_QSPI1_MISO1           NVT_PINMUX('G', 9, SYS_GPG_MFP2_PG9MFP_QSPI1_MISO1)
#define PG9MFP_CCAP_PIXCLK           NVT_PINMUX('G', 9, SYS_GPG_MFP2_PG9MFP_CCAP_PIXCLK)
#define PG9MFP_ECAP2_IC0             NVT_PINMUX('G', 9, SYS_GPG_MFP2_PG9MFP_ECAP2_IC0)
#define PG9MFP_BPWM0_CH5             NVT_PINMUX('G', 9, SYS_GPG_MFP2_PG9MFP_BPWM0_CH5)
#define PG10MFP_GPIO                 NVT_PINMUX('G', 10, SYS_GPG_MFP2_PG10MFP_GPIO)
#define PG10MFP_EBI_AD1              NVT_PINMUX('G', 10, SYS_GPG_MFP2_PG10MFP_EBI_AD1)
#define PG10MFP_SD1_DAT2             NVT_PINMUX('G', 10, SYS_GPG_MFP2_PG10MFP_SD1_DAT2)
#define PG10MFP_QSPI1_MOSI1          NVT_PINMUX('G', 10, SYS_GPG_MFP2_PG10MFP_QSPI1_MOSI1)
#define PG10MFP_CCAP_SCLK            NVT_PINMUX('G', 10, SYS_GPG_MFP2_PG10MFP_CCAP_SCLK)
#define PG10MFP_ECAP2_IC1            NVT_PINMUX('G', 10, SYS_GPG_MFP2_PG10MFP_ECAP2_IC1)
#define PG10MFP_BPWM0_CH4            NVT_PINMUX('G', 10, SYS_GPG_MFP2_PG10MFP_BPWM0_CH4)
#define PG11MFP_GPIO                 NVT_PINMUX('G', 11, SYS_GPG_MFP2_PG11MFP_GPIO)
#define PG11MFP_EBI_AD2              NVT_PINMUX('G', 11, SYS_GPG_MFP2_PG11MFP_EBI_AD2)
#define PG11MFP_SD1_DAT1             NVT_PINMUX('G', 11, SYS_GPG_MFP2_PG11MFP_SD1_DAT1)
#define PG11MFP_QSPI1_SS             NVT_PINMUX('G', 11, SYS_GPG_MFP2_PG11MFP_QSPI1_SS)
#define PG11MFP_UART7_TXD            NVT_PINMUX('G', 11, SYS_GPG_MFP2_PG11MFP_UART7_TXD)
#define PG11MFP_CCAP_SFIELD          NVT_PINMUX('G', 11, SYS_GPG_MFP2_PG11MFP_CCAP_SFIELD)
#define PG11MFP_ECAP2_IC2            NVT_PINMUX('G', 11, SYS_GPG_MFP2_PG11MFP_ECAP2_IC2)
#define PG11MFP_BPWM0_CH3            NVT_PINMUX('G', 11, SYS_GPG_MFP2_PG11MFP_BPWM0_CH3)
#define PG12MFP_GPIO                 NVT_PINMUX('G', 12, SYS_GPG_MFP3_PG12MFP_GPIO)
#define PG12MFP_EBI_AD3              NVT_PINMUX('G', 12, SYS_GPG_MFP3_PG12MFP_EBI_AD3)
#define PG12MFP_SD1_DAT0             NVT_PINMUX('G', 12, SYS_GPG_MFP3_PG12MFP_SD1_DAT0)
#define PG12MFP_QSPI1_CLK            NVT_PINMUX('G', 12, SYS_GPG_MFP3_PG12MFP_QSPI1_CLK)
#define PG12MFP_UART7_RXD            NVT_PINMUX('G', 12, SYS_GPG_MFP3_PG12MFP_UART7_RXD)
#define PG12MFP_CCAP_VSYNC           NVT_PINMUX('G', 12, SYS_GPG_MFP3_PG12MFP_CCAP_VSYNC)
#define PG12MFP_BPWM0_CH2            NVT_PINMUX('G', 12, SYS_GPG_MFP3_PG12MFP_BPWM0_CH2)
#define PG13MFP_GPIO                 NVT_PINMUX('G', 13, SYS_GPG_MFP3_PG13MFP_GPIO)
#define PG13MFP_EBI_AD4              NVT_PINMUX('G', 13, SYS_GPG_MFP3_PG13MFP_EBI_AD4)
#define PG13MFP_UART1_TXD            NVT_PINMUX('G', 13, SYS_GPG_MFP3_PG13MFP_UART1_TXD)
#define PG13MFP_I2C0_SCL             NVT_PINMUX('G', 13, SYS_GPG_MFP3_PG13MFP_I2C0_SCL)
#define PG13MFP_SPI1_MISO            NVT_PINMUX('G', 13, SYS_GPG_MFP3_PG13MFP_SPI1_MISO)
#define PG13MFP_QSPI1_MISO0          NVT_PINMUX('G', 13, SYS_GPG_MFP3_PG13MFP_QSPI1_MISO0)
#define PG13MFP_CCAP_HSYNC           NVT_PINMUX('G', 13, SYS_GPG_MFP3_PG13MFP_CCAP_HSYNC)
#define PG13MFP_SC1_PWR              NVT_PINMUX('G', 13, SYS_GPG_MFP3_PG13MFP_SC1_PWR)
#define PG13MFP_SPIM0_D6             NVT_PINMUX('G', 13, SYS_GPG_MFP3_PG13MFP_SPIM0_D6)
#define PG13MFP_PSIO0_CH4            NVT_PINMUX('G', 13, SYS_GPG_MFP3_PG13MFP_PSIO0_CH4)
#define PG13MFP_LPI2C0_SCL           NVT_PINMUX('G', 13, SYS_GPG_MFP3_PG13MFP_LPI2C0_SCL)
#define PG14MFP_GPIO                 NVT_PINMUX('G', 14, SYS_GPG_MFP3_PG14MFP_GPIO)
#define PG14MFP_EBI_AD5              NVT_PINMUX('G', 14, SYS_GPG_MFP3_PG14MFP_EBI_AD5)
#define PG14MFP_UART1_RXD            NVT_PINMUX('G', 14, SYS_GPG_MFP3_PG14MFP_UART1_RXD)
#define PG14MFP_I2C0_SDA             NVT_PINMUX('G', 14, SYS_GPG_MFP3_PG14MFP_I2C0_SDA)
#define PG14MFP_SPI1_MOSI            NVT_PINMUX('G', 14, SYS_GPG_MFP3_PG14MFP_SPI1_MOSI)
#define PG14MFP_QSPI1_MOSI0          NVT_PINMUX('G', 14, SYS_GPG_MFP3_PG14MFP_QSPI1_MOSI0)
#define PG14MFP_SC1_RST              NVT_PINMUX('G', 14, SYS_GPG_MFP3_PG14MFP_SC1_RST)
#define PG14MFP_SPIM0_D7             NVT_PINMUX('G', 14, SYS_GPG_MFP3_PG14MFP_SPIM0_D7)
#define PG14MFP_ACMP0_O              NVT_PINMUX('G', 14, SYS_GPG_MFP3_PG14MFP_ACMP0_O)
#define PG14MFP_EADC0_ST             NVT_PINMUX('G', 14, SYS_GPG_MFP3_PG14MFP_EADC0_ST)
#define PG14MFP_PSIO0_CH5            NVT_PINMUX('G', 14, SYS_GPG_MFP3_PG14MFP_PSIO0_CH5)
#define PG14MFP_LPI2C0_SDA           NVT_PINMUX('G', 14, SYS_GPG_MFP3_PG14MFP_LPI2C0_SDA)
#define PG15MFP_GPIO                 NVT_PINMUX('G', 15, SYS_GPG_MFP3_PG15MFP_GPIO)
#define PG15MFP_I2C1_SCL             NVT_PINMUX('G', 15, SYS_GPG_MFP3_PG15MFP_I2C1_SCL)
#define PG15MFP_SPI1_CLK             NVT_PINMUX('G', 15, SYS_GPG_MFP3_PG15MFP_SPI1_CLK)
#define PG15MFP_SC1_DAT              NVT_PINMUX('G', 15, SYS_GPG_MFP3_PG15MFP_SC1_DAT)
#define PG15MFP_SPIM0_RWDS           NVT_PINMUX('G', 15, SYS_GPG_MFP3_PG15MFP_SPIM0_RWDS)
#define PG15MFP_ACMP1_O              NVT_PINMUX('G', 15, SYS_GPG_MFP3_PG15MFP_ACMP1_O)
#define PG15MFP_PSIO0_CH6            NVT_PINMUX('G', 15, SYS_GPG_MFP3_PG15MFP_PSIO0_CH6)
#define PH0MFP_GPIO                  NVT_PINMUX('H', 0, SYS_GPH_MFP0_PH0MFP_GPIO)
#define PH0MFP_EBI_ADR7              NVT_PINMUX('H', 0, SYS_GPH_MFP0_PH0MFP_EBI_ADR7)
#define PH0MFP_SPI3_MISO             NVT_PINMUX('H', 0, SYS_GPH_MFP0_PH0MFP_SPI3_MISO)
#define PH0MFP_UART5_TXD             NVT_PINMUX('H', 0, SYS_GPH_MFP0_PH0MFP_UART5_TXD)
#define PH0MFP_SC1_DAT               NVT_PINMUX('H', 0, SYS_GPH_MFP0_PH0MFP_SC1_DAT)
#define PH0MFP_I2C3_SCL              NVT_PINMUX('H', 0, SYS_GPH_MFP0_PH0MFP_I2C3_SCL)
#define PH0MFP_TM0_EXT               NVT_PINMUX('H', 0, SYS_GPH_MFP0_PH0MFP_TM0_EXT)
#define PH1MFP_GPIO                  NVT_PINMUX('H', 1, SYS_GPH_MFP0_PH1MFP_GPIO)
#define PH1MFP_EBI_ADR6              NVT_PINMUX('H', 1, SYS_GPH_MFP0_PH1MFP_EBI_ADR6)
#define PH1MFP_SPI3_MOSI             NVT_PINMUX('H', 1, SYS_GPH_MFP0_PH1MFP_SPI3_MOSI)
#define PH1MFP_UART5_RXD             NVT_PINMUX('H', 1, SYS_GPH_MFP0_PH1MFP_UART5_RXD)
#define PH1MFP_SC1_CLK               NVT_PINMUX('H', 1, SYS_GPH_MFP0_PH1MFP_SC1_CLK)
#define PH1MFP_I2C3_SDA              NVT_PINMUX('H', 1, SYS_GPH_MFP0_PH1MFP_I2C3_SDA)
#define PH1MFP_TM1_EXT               NVT_PINMUX('H', 1, SYS_GPH_MFP0_PH1MFP_TM1_EXT)
#define PH2MFP_GPIO                  NVT_PINMUX('H', 2, SYS_GPH_MFP0_PH2MFP_GPIO)
#define PH2MFP_EBI_ADR5              NVT_PINMUX('H', 2, SYS_GPH_MFP0_PH2MFP_EBI_ADR5)
#define PH2MFP_UART5_nRTS            NVT_PINMUX('H', 2, SYS_GPH_MFP0_PH2MFP_UART5_nRTS)
#define PH2MFP_UART4_TXD             NVT_PINMUX('H', 2, SYS_GPH_MFP0_PH2MFP_UART4_TXD)
#define PH2MFP_I2C0_SCL              NVT_PINMUX('H', 2, SYS_GPH_MFP0_PH2MFP_I2C0_SCL)
#define PH2MFP_UART9_RXD             NVT_PINMUX('H', 2, SYS_GPH_MFP0_PH2MFP_UART9_RXD)
#define PH2MFP_TM2_EXT               NVT_PINMUX('H', 2, SYS_GPH_MFP0_PH2MFP_TM2_EXT)
#define PH3MFP_GPIO                  NVT_PINMUX('H', 3, SYS_GPH_MFP0_PH3MFP_GPIO)
#define PH3MFP_EBI_ADR4              NVT_PINMUX('H', 3, SYS_GPH_MFP0_PH3MFP_EBI_ADR4)
#define PH3MFP_SPI1_I2SMCLK          NVT_PINMUX('H', 3, SYS_GPH_MFP0_PH3MFP_SPI1_I2SMCLK)
#define PH3MFP_UART5_nCTS            NVT_PINMUX('H', 3, SYS_GPH_MFP0_PH3MFP_UART5_nCTS)
#define PH3MFP_UART4_RXD             NVT_PINMUX('H', 3, SYS_GPH_MFP0_PH3MFP_UART4_RXD)
#define PH3MFP_I2C0_SDA              NVT_PINMUX('H', 3, SYS_GPH_MFP0_PH3MFP_I2C0_SDA)
#define PH3MFP_TM3_EXT               NVT_PINMUX('H', 3, SYS_GPH_MFP0_PH3MFP_TM3_EXT)
#define PH4MFP_GPIO                  NVT_PINMUX('H', 4, SYS_GPH_MFP1_PH4MFP_GPIO)
#define PH4MFP_EBI_ADR3              NVT_PINMUX('H', 4, SYS_GPH_MFP1_PH4MFP_EBI_ADR3)
#define PH4MFP_SPI1_MISO             NVT_PINMUX('H', 4, SYS_GPH_MFP1_PH4MFP_SPI1_MISO)
#define PH4MFP_UART7_nRTS            NVT_PINMUX('H', 4, SYS_GPH_MFP1_PH4MFP_UART7_nRTS)
#define PH4MFP_UART6_TXD             NVT_PINMUX('H', 4, SYS_GPH_MFP1_PH4MFP_UART6_TXD)
#define PH4MFP_SPI3_I2SMCLK          NVT_PINMUX('H', 4, SYS_GPH_MFP1_PH4MFP_SPI3_I2SMCLK)
#define PH4MFP_EPWM0_CH5             NVT_PINMUX('H', 4, SYS_GPH_MFP1_PH4MFP_EPWM0_CH5)
#define PH5MFP_GPIO                  NVT_PINMUX('H', 5, SYS_GPH_MFP1_PH5MFP_GPIO)
#define PH5MFP_EBI_ADR2              NVT_PINMUX('H', 5, SYS_GPH_MFP1_PH5MFP_EBI_ADR2)
#define PH5MFP_SPI1_MOSI             NVT_PINMUX('H', 5, SYS_GPH_MFP1_PH5MFP_SPI1_MOSI)
#define PH5MFP_UART7_nCTS            NVT_PINMUX('H', 5, SYS_GPH_MFP1_PH5MFP_UART7_nCTS)
#define PH5MFP_UART6_RXD             NVT_PINMUX('H', 5, SYS_GPH_MFP1_PH5MFP_UART6_RXD)
#define PH5MFP_EPWM0_CH4             NVT_PINMUX('H', 5, SYS_GPH_MFP1_PH5MFP_EPWM0_CH4)
#define PH6MFP_GPIO                  NVT_PINMUX('H', 6, SYS_GPH_MFP1_PH6MFP_GPIO)
#define PH6MFP_EBI_ADR1              NVT_PINMUX('H', 6, SYS_GPH_MFP1_PH6MFP_EBI_ADR1)
#define PH6MFP_SPI1_CLK              NVT_PINMUX('H', 6, SYS_GPH_MFP1_PH6MFP_SPI1_CLK)
#define PH6MFP_UART7_TXD             NVT_PINMUX('H', 6, SYS_GPH_MFP1_PH6MFP_UART7_TXD)
#define PH6MFP_UART9_nCTS            NVT_PINMUX('H', 6, SYS_GPH_MFP1_PH6MFP_UART9_nCTS)
#define PH7MFP_GPIO                  NVT_PINMUX('H', 7, SYS_GPH_MFP1_PH7MFP_GPIO)
#define PH7MFP_EBI_ADR0              NVT_PINMUX('H', 7, SYS_GPH_MFP1_PH7MFP_EBI_ADR0)
#define PH7MFP_SPI1_SS               NVT_PINMUX('H', 7, SYS_GPH_MFP1_PH7MFP_SPI1_SS)
#define PH7MFP_UART7_RXD             NVT_PINMUX('H', 7, SYS_GPH_MFP1_PH7MFP_UART7_RXD)
#define PH7MFP_UART9_nRTS            NVT_PINMUX('H', 7, SYS_GPH_MFP1_PH7MFP_UART9_nRTS)
#define PH7MFP_I2S1_BCLK             NVT_PINMUX('H', 7, SYS_GPH_MFP1_PH7MFP_I2S1_BCLK)
#define PH8MFP_GPIO                  NVT_PINMUX('H', 8, SYS_GPH_MFP2_PH8MFP_GPIO)
#define PH8MFP_EBI_AD12              NVT_PINMUX('H', 8, SYS_GPH_MFP2_PH8MFP_EBI_AD12)
#define PH8MFP_QSPI0_CLK             NVT_PINMUX('H', 8, SYS_GPH_MFP2_PH8MFP_QSPI0_CLK)
#define PH8MFP_SC2_PWR               NVT_PINMUX('H', 8, SYS_GPH_MFP2_PH8MFP_SC2_PWR)
#define PH8MFP_I2S0_DI               NVT_PINMUX('H', 8, SYS_GPH_MFP2_PH8MFP_I2S0_DI)
#define PH8MFP_SPI1_CLK              NVT_PINMUX('H', 8, SYS_GPH_MFP2_PH8MFP_SPI1_CLK)
#define PH8MFP_UART3_nRTS            NVT_PINMUX('H', 8, SYS_GPH_MFP2_PH8MFP_UART3_nRTS)
#define PH8MFP_I2C1_SMBAL            NVT_PINMUX('H', 8, SYS_GPH_MFP2_PH8MFP_I2C1_SMBAL)
#define PH8MFP_I2C2_SCL              NVT_PINMUX('H', 8, SYS_GPH_MFP2_PH8MFP_I2C2_SCL)
#define PH8MFP_UART1_TXD             NVT_PINMUX('H', 8, SYS_GPH_MFP2_PH8MFP_UART1_TXD)
#define PH8MFP_UART9_nCTS            NVT_PINMUX('H', 8, SYS_GPH_MFP2_PH8MFP_UART9_nCTS)
#define PH8MFP_I3C0_SCL              NVT_PINMUX('H', 8, SYS_GPH_MFP2_PH8MFP_I3C0_SCL)
#define PH9MFP_GPIO                  NVT_PINMUX('H', 9, SYS_GPH_MFP2_PH9MFP_GPIO)
#define PH9MFP_EBI_AD13              NVT_PINMUX('H', 9, SYS_GPH_MFP2_PH9MFP_EBI_AD13)
#define PH9MFP_QSPI0_SS              NVT_PINMUX('H', 9, SYS_GPH_MFP2_PH9MFP_QSPI0_SS)
#define PH9MFP_SC2_RST               NVT_PINMUX('H', 9, SYS_GPH_MFP2_PH9MFP_SC2_RST)
#define PH9MFP_I2S0_DO               NVT_PINMUX('H', 9, SYS_GPH_MFP2_PH9MFP_I2S0_DO)
#define PH9MFP_SPI1_SS               NVT_PINMUX('H', 9, SYS_GPH_MFP2_PH9MFP_SPI1_SS)
#define PH9MFP_UART3_nCTS            NVT_PINMUX('H', 9, SYS_GPH_MFP2_PH9MFP_UART3_nCTS)
#define PH9MFP_I2C1_SMBSUS           NVT_PINMUX('H', 9, SYS_GPH_MFP2_PH9MFP_I2C1_SMBSUS)
#define PH9MFP_I2C2_SDA              NVT_PINMUX('H', 9, SYS_GPH_MFP2_PH9MFP_I2C2_SDA)
#define PH9MFP_UART1_RXD             NVT_PINMUX('H', 9, SYS_GPH_MFP2_PH9MFP_UART1_RXD)
#define PH9MFP_UART9_nRTS            NVT_PINMUX('H', 9, SYS_GPH_MFP2_PH9MFP_UART9_nRTS)
#define PH9MFP_I3C0_SDA              NVT_PINMUX('H', 9, SYS_GPH_MFP2_PH9MFP_I3C0_SDA)
#define PH10MFP_GPIO                 NVT_PINMUX('H', 10, SYS_GPH_MFP2_PH10MFP_GPIO)
#define PH10MFP_EBI_AD14             NVT_PINMUX('H', 10, SYS_GPH_MFP2_PH10MFP_EBI_AD14)
#define PH10MFP_QSPI0_MISO1          NVT_PINMUX('H', 10, SYS_GPH_MFP2_PH10MFP_QSPI0_MISO1)
#define PH10MFP_SC2_nCD              NVT_PINMUX('H', 10, SYS_GPH_MFP2_PH10MFP_SC2_nCD)
#define PH10MFP_I2S0_LRCK            NVT_PINMUX('H', 10, SYS_GPH_MFP2_PH10MFP_I2S0_LRCK)
#define PH10MFP_SPI1_I2SMCLK         NVT_PINMUX('H', 10, SYS_GPH_MFP2_PH10MFP_SPI1_I2SMCLK)
#define PH10MFP_UART4_TXD            NVT_PINMUX('H', 10, SYS_GPH_MFP2_PH10MFP_UART4_TXD)
#define PH10MFP_UART0_TXD            NVT_PINMUX('H', 10, SYS_GPH_MFP2_PH10MFP_UART0_TXD)
#define PH10MFP_UART9_TXD            NVT_PINMUX('H', 10, SYS_GPH_MFP2_PH10MFP_UART9_TXD)
#define PH10MFP_I3C0_PUPEN           NVT_PINMUX('H', 10, SYS_GPH_MFP2_PH10MFP_I3C0_PUPEN)
#define PH10MFP_LPUART0_TXD          NVT_PINMUX('H', 10, SYS_GPH_MFP2_PH10MFP_LPUART0_TXD)
#define PH11MFP_GPIO                 NVT_PINMUX('H', 11, SYS_GPH_MFP2_PH11MFP_GPIO)
#define PH11MFP_EBI_AD15             NVT_PINMUX('H', 11, SYS_GPH_MFP2_PH11MFP_EBI_AD15)
#define PH11MFP_QSPI0_MOSI1          NVT_PINMUX('H', 11, SYS_GPH_MFP2_PH11MFP_QSPI0_MOSI1)
#define PH11MFP_UART4_RXD            NVT_PINMUX('H', 11, SYS_GPH_MFP2_PH11MFP_UART4_RXD)
#define PH11MFP_UART0_RXD            NVT_PINMUX('H', 11, SYS_GPH_MFP2_PH11MFP_UART0_RXD)
#define PH11MFP_EPWM0_CH5            NVT_PINMUX('H', 11, SYS_GPH_MFP2_PH11MFP_EPWM0_CH5)
#define PH11MFP_UART9_RXD            NVT_PINMUX('H', 11, SYS_GPH_MFP2_PH11MFP_UART9_RXD)
#define PH11MFP_LPUART0_RXD          NVT_PINMUX('H', 11, SYS_GPH_MFP2_PH11MFP_LPUART0_RXD)
#define PH12MFP_GPIO                 NVT_PINMUX('H', 12, SYS_GPH_MFP3_PH12MFP_GPIO)
#define PH12MFP_EBI_AD0              NVT_PINMUX('H', 12, SYS_GPH_MFP3_PH12MFP_EBI_AD0)
#define PH12MFP_UART9_TXD            NVT_PINMUX('H', 12, SYS_GPH_MFP3_PH12MFP_UART9_TXD)
#define PH12MFP_QSPI1_MISO1          NVT_PINMUX('H', 12, SYS_GPH_MFP3_PH12MFP_QSPI1_MISO1)
#define PH12MFP_CCAP_PIXCLK          NVT_PINMUX('H', 12, SYS_GPH_MFP3_PH12MFP_CCAP_PIXCLK)
#define PH12MFP_SPIM0_CLKN           NVT_PINMUX('H', 12, SYS_GPH_MFP3_PH12MFP_SPIM0_CLKN)
#define PH13MFP_GPIO                 NVT_PINMUX('H', 13, SYS_GPH_MFP3_PH13MFP_GPIO)
#define PH13MFP_EBI_AD1              NVT_PINMUX('H', 13, SYS_GPH_MFP3_PH13MFP_EBI_AD1)
#define PH13MFP_UART9_RXD            NVT_PINMUX('H', 13, SYS_GPH_MFP3_PH13MFP_UART9_RXD)
#define PH13MFP_QSPI1_MOSI1          NVT_PINMUX('H', 13, SYS_GPH_MFP3_PH13MFP_QSPI1_MOSI1)
#define PH13MFP_CCAP_SCLK            NVT_PINMUX('H', 13, SYS_GPH_MFP3_PH13MFP_CCAP_SCLK)
#define PH13MFP_SPIM0_CLK            NVT_PINMUX('H', 13, SYS_GPH_MFP3_PH13MFP_SPIM0_CLK)
#define PH14MFP_GPIO                 NVT_PINMUX('H', 14, SYS_GPH_MFP3_PH14MFP_GPIO)
#define PH14MFP_EBI_AD2              NVT_PINMUX('H', 14, SYS_GPH_MFP3_PH14MFP_EBI_AD2)
#define PH14MFP_QSPI1_SS             NVT_PINMUX('H', 14, SYS_GPH_MFP3_PH14MFP_QSPI1_SS)
#define PH14MFP_CCAP_SFIELD          NVT_PINMUX('H', 14, SYS_GPH_MFP3_PH14MFP_CCAP_SFIELD)
#define PH14MFP_SPIM0_D4             NVT_PINMUX('H', 14, SYS_GPH_MFP3_PH14MFP_SPIM0_D4)
#define PH15MFP_GPIO                 NVT_PINMUX('H', 15, SYS_GPH_MFP3_PH15MFP_GPIO)
#define PH15MFP_EBI_AD3              NVT_PINMUX('H', 15, SYS_GPH_MFP3_PH15MFP_EBI_AD3)
#define PH15MFP_QSPI1_CLK            NVT_PINMUX('H', 15, SYS_GPH_MFP3_PH15MFP_QSPI1_CLK)
#define PH15MFP_CCAP_VSYNC           NVT_PINMUX('H', 15, SYS_GPH_MFP3_PH15MFP_CCAP_VSYNC)
#define PH15MFP_SPIM0_D5             NVT_PINMUX('H', 15, SYS_GPH_MFP3_PH15MFP_SPIM0_D5)
#define PI6MFP_GPIO                  NVT_PINMUX('I', 6, SYS_GPI_MFP1_PI6MFP_GPIO)
#define PI6MFP_SC1_nCD               NVT_PINMUX('I', 6, SYS_GPI_MFP1_PI6MFP_SC1_nCD)
#define PI6MFP_I2S0_BCLK             NVT_PINMUX('I', 6, SYS_GPI_MFP1_PI6MFP_I2S0_BCLK)
#define PI6MFP_SPI1_I2SMCLK          NVT_PINMUX('I', 6, SYS_GPI_MFP1_PI6MFP_SPI1_I2SMCLK)
#define PI6MFP_UART2_TXD             NVT_PINMUX('I', 6, SYS_GPI_MFP1_PI6MFP_UART2_TXD)
#define PI6MFP_I2C1_SCL              NVT_PINMUX('I', 6, SYS_GPI_MFP1_PI6MFP_I2C1_SCL)
#define PI6MFP_USB_VBUS_ST           NVT_PINMUX('I', 6, SYS_GPI_MFP1_PI6MFP_USB_VBUS_ST)
#define PI7MFP_GPIO                  NVT_PINMUX('I', 7, SYS_GPI_MFP1_PI7MFP_GPIO)
#define PI7MFP_SC1_PWR               NVT_PINMUX('I', 7, SYS_GPI_MFP1_PI7MFP_SC1_PWR)
#define PI7MFP_I2S0_MCLK             NVT_PINMUX('I', 7, SYS_GPI_MFP1_PI7MFP_I2S0_MCLK)
#define PI7MFP_SPI1_MISO             NVT_PINMUX('I', 7, SYS_GPI_MFP1_PI7MFP_SPI1_MISO)
#define PI7MFP_UART2_RXD             NVT_PINMUX('I', 7, SYS_GPI_MFP1_PI7MFP_UART2_RXD)
#define PI7MFP_I2C1_SDA              NVT_PINMUX('I', 7, SYS_GPI_MFP1_PI7MFP_I2C1_SDA)
#define PI7MFP_USB_VBUS_EN           NVT_PINMUX('I', 7, SYS_GPI_MFP1_PI7MFP_USB_VBUS_EN)
#define PI8MFP_GPIO                  NVT_PINMUX('I', 8, SYS_GPI_MFP2_PI8MFP_GPIO)
#define PI8MFP_SC1_RST               NVT_PINMUX('I', 8, SYS_GPI_MFP2_PI8MFP_SC1_RST)
#define PI8MFP_I2S0_DI               NVT_PINMUX('I', 8, SYS_GPI_MFP2_PI8MFP_I2S0_DI)
#define PI8MFP_SPI1_MOSI             NVT_PINMUX('I', 8, SYS_GPI_MFP2_PI8MFP_SPI1_MOSI)
#define PI8MFP_UART2_nRTS            NVT_PINMUX('I', 8, SYS_GPI_MFP2_PI8MFP_UART2_nRTS)
#define PI8MFP_I2C0_SMBAL            NVT_PINMUX('I', 8, SYS_GPI_MFP2_PI8MFP_I2C0_SMBAL)
#define PI9MFP_GPIO                  NVT_PINMUX('I', 9, SYS_GPI_MFP2_PI9MFP_GPIO)
#define PI9MFP_SC1_DAT               NVT_PINMUX('I', 9, SYS_GPI_MFP2_PI9MFP_SC1_DAT)
#define PI9MFP_I2S0_DO               NVT_PINMUX('I', 9, SYS_GPI_MFP2_PI9MFP_I2S0_DO)
#define PI9MFP_SPI1_CLK              NVT_PINMUX('I', 9, SYS_GPI_MFP2_PI9MFP_SPI1_CLK)
#define PI9MFP_UART2_nCTS            NVT_PINMUX('I', 9, SYS_GPI_MFP2_PI9MFP_UART2_nCTS)
#define PI9MFP_I2C0_SMBSUS           NVT_PINMUX('I', 9, SYS_GPI_MFP2_PI9MFP_I2C0_SMBSUS)
#define PI10MFP_GPIO                 NVT_PINMUX('I', 10, SYS_GPI_MFP2_PI10MFP_GPIO)
#define PI10MFP_SC1_CLK              NVT_PINMUX('I', 10, SYS_GPI_MFP2_PI10MFP_SC1_CLK)
#define PI10MFP_I2S0_LRCK            NVT_PINMUX('I', 10, SYS_GPI_MFP2_PI10MFP_I2S0_LRCK)
#define PI10MFP_SPI1_SS              NVT_PINMUX('I', 10, SYS_GPI_MFP2_PI10MFP_SPI1_SS)
#define PI10MFP_UART2_TXD            NVT_PINMUX('I', 10, SYS_GPI_MFP2_PI10MFP_UART2_TXD)
#define PI10MFP_I2C0_SCL             NVT_PINMUX('I', 10, SYS_GPI_MFP2_PI10MFP_I2C0_SCL)
#define PI11MFP_GPIO                 NVT_PINMUX('I', 11, SYS_GPI_MFP2_PI11MFP_GPIO)
#define PI11MFP_UART2_RXD            NVT_PINMUX('I', 11, SYS_GPI_MFP2_PI11MFP_UART2_RXD)
#define PI11MFP_I2C0_SDA             NVT_PINMUX('I', 11, SYS_GPI_MFP2_PI11MFP_I2C0_SDA)
#define PI12MFP_GPIO                 NVT_PINMUX('I', 12, SYS_GPI_MFP3_PI12MFP_GPIO)
#define PI12MFP_QSPI0_MISO1          NVT_PINMUX('I', 12, SYS_GPI_MFP3_PI12MFP_QSPI0_MISO1)
#define PI12MFP_CANFD0_TXD           NVT_PINMUX('I', 12, SYS_GPI_MFP3_PI12MFP_CANFD0_TXD)
#define PI12MFP_UART4_TXD            NVT_PINMUX('I', 12, SYS_GPI_MFP3_PI12MFP_UART4_TXD)
#define PI12MFP_EPWM1_CH0            NVT_PINMUX('I', 12, SYS_GPI_MFP3_PI12MFP_EPWM1_CH0)
#define PI12MFP_I2C3_SMBAL           NVT_PINMUX('I', 12, SYS_GPI_MFP3_PI12MFP_I2C3_SMBAL)
#define PI13MFP_GPIO                 NVT_PINMUX('I', 13, SYS_GPI_MFP3_PI13MFP_GPIO)
#define PI13MFP_QSPI0_MOSI1          NVT_PINMUX('I', 13, SYS_GPI_MFP3_PI13MFP_QSPI0_MOSI1)
#define PI13MFP_CANFD0_RXD           NVT_PINMUX('I', 13, SYS_GPI_MFP3_PI13MFP_CANFD0_RXD)
#define PI13MFP_UART4_RXD            NVT_PINMUX('I', 13, SYS_GPI_MFP3_PI13MFP_UART4_RXD)
#define PI13MFP_EPWM1_CH1            NVT_PINMUX('I', 13, SYS_GPI_MFP3_PI13MFP_EPWM1_CH1)
#define PI13MFP_I2C3_SMBSUS          NVT_PINMUX('I', 13, SYS_GPI_MFP3_PI13MFP_I2C3_SMBSUS)
#define PI14MFP_GPIO                 NVT_PINMUX('I', 14, SYS_GPI_MFP3_PI14MFP_GPIO)
#define PI14MFP_QSPI0_SS             NVT_PINMUX('I', 14, SYS_GPI_MFP3_PI14MFP_QSPI0_SS)
#define PI14MFP_UART8_nCTS           NVT_PINMUX('I', 14, SYS_GPI_MFP3_PI14MFP_UART8_nCTS)
#define PI14MFP_CANFD1_TXD           NVT_PINMUX('I', 14, SYS_GPI_MFP3_PI14MFP_CANFD1_TXD)
#define PI14MFP_UART3_TXD            NVT_PINMUX('I', 14, SYS_GPI_MFP3_PI14MFP_UART3_TXD)
#define PI14MFP_EPWM1_CH2            NVT_PINMUX('I', 14, SYS_GPI_MFP3_PI14MFP_EPWM1_CH2)
#define PI14MFP_I2C3_SCL             NVT_PINMUX('I', 14, SYS_GPI_MFP3_PI14MFP_I2C3_SCL)
#define PI15MFP_GPIO                 NVT_PINMUX('I', 15, SYS_GPI_MFP3_PI15MFP_GPIO)
#define PI15MFP_QSPI0_CLK            NVT_PINMUX('I', 15, SYS_GPI_MFP3_PI15MFP_QSPI0_CLK)
#define PI15MFP_UART8_nRTS           NVT_PINMUX('I', 15, SYS_GPI_MFP3_PI15MFP_UART8_nRTS)
#define PI15MFP_CANFD1_RXD           NVT_PINMUX('I', 15, SYS_GPI_MFP3_PI15MFP_CANFD1_RXD)
#define PI15MFP_UART3_RXD            NVT_PINMUX('I', 15, SYS_GPI_MFP3_PI15MFP_UART3_RXD)
#define PI15MFP_EPWM1_CH3            NVT_PINMUX('I', 15, SYS_GPI_MFP3_PI15MFP_EPWM1_CH3)
#define PI15MFP_I2C3_SDA             NVT_PINMUX('I', 15, SYS_GPI_MFP3_PI15MFP_I2C3_SDA)
#define PJ0MFP_GPIO                  NVT_PINMUX('J', 0, SYS_GPJ_MFP0_PJ0MFP_GPIO)
#define PJ0MFP_UTCPD0_DISCHG         NVT_PINMUX('J', 0, SYS_GPJ_MFP0_PJ0MFP_UTCPD0_DISCHG)
#define PJ0MFP_QSPI0_MISO0           NVT_PINMUX('J', 0, SYS_GPJ_MFP0_PJ0MFP_QSPI0_MISO0)
#define PJ0MFP_UART8_TXD             NVT_PINMUX('J', 0, SYS_GPJ_MFP0_PJ0MFP_UART8_TXD)
#define PJ0MFP_EPWM1_CH4             NVT_PINMUX('J', 0, SYS_GPJ_MFP0_PJ0MFP_EPWM1_CH4)
#define PJ1MFP_GPIO                  NVT_PINMUX('J', 1, SYS_GPJ_MFP0_PJ1MFP_GPIO)
#define PJ1MFP_QSPI0_MOSI0           NVT_PINMUX('J', 1, SYS_GPJ_MFP0_PJ1MFP_QSPI0_MOSI0)
#define PJ1MFP_UART8_RXD             NVT_PINMUX('J', 1, SYS_GPJ_MFP0_PJ1MFP_UART8_RXD)
#define PJ1MFP_EPWM1_CH5             NVT_PINMUX('J', 1, SYS_GPJ_MFP0_PJ1MFP_EPWM1_CH5)
#define PJ2MFP_GPIO                  NVT_PINMUX('J', 2, SYS_GPJ_MFP0_PJ2MFP_GPIO)
#define PJ2MFP_EBI_AD5               NVT_PINMUX('J', 2, SYS_GPJ_MFP0_PJ2MFP_EBI_AD5)
#define PJ2MFP_UART8_nCTS            NVT_PINMUX('J', 2, SYS_GPJ_MFP0_PJ2MFP_UART8_nCTS)
#define PJ2MFP_I2C3_SMBAL            NVT_PINMUX('J', 2, SYS_GPJ_MFP0_PJ2MFP_I2C3_SMBAL)
#define PJ2MFP_QSPI1_SS              NVT_PINMUX('J', 2, SYS_GPJ_MFP0_PJ2MFP_QSPI1_SS)
#define PJ2MFP_CCAP_DATA5            NVT_PINMUX('J', 2, SYS_GPJ_MFP0_PJ2MFP_CCAP_DATA5)
#define PJ2MFP_CANFD0_TXD            NVT_PINMUX('J', 2, SYS_GPJ_MFP0_PJ2MFP_CANFD0_TXD)
#define PJ2MFP_SPIM0_RESETN          NVT_PINMUX('J', 2, SYS_GPJ_MFP0_PJ2MFP_SPIM0_RESETN)
#define PJ3MFP_GPIO                  NVT_PINMUX('J', 3, SYS_GPJ_MFP0_PJ3MFP_GPIO)
#define PJ3MFP_EBI_AD4               NVT_PINMUX('J', 3, SYS_GPJ_MFP0_PJ3MFP_EBI_AD4)
#define PJ3MFP_UART8_nRTS            NVT_PINMUX('J', 3, SYS_GPJ_MFP0_PJ3MFP_UART8_nRTS)
#define PJ3MFP_I2C3_SMBSUS           NVT_PINMUX('J', 3, SYS_GPJ_MFP0_PJ3MFP_I2C3_SMBSUS)
#define PJ3MFP_QSPI1_CLK             NVT_PINMUX('J', 3, SYS_GPJ_MFP0_PJ3MFP_QSPI1_CLK)
#define PJ3MFP_CCAP_DATA4            NVT_PINMUX('J', 3, SYS_GPJ_MFP0_PJ3MFP_CCAP_DATA4)
