zephyrproject-rtos/hal_nuvoton/dts/pinctrl/m55m1h2l-pinctrl.h
#define PJ3MFP_CANFD0_RXD            NVT_PINMUX('J', 3, SYS_GPJ_MFP0_PJ3MFP_CANFD0_RXD)
#define PJ3MFP_SPIM0_MOSI            NVT_PINMUX('J', 3, SYS_GPJ_MFP0_PJ3MFP_SPIM0_MOSI)
#define PJ4MFP_GPIO                  NVT_PINMUX('J', 4, SYS_GPJ_MFP1_PJ4MFP_GPIO)
#define PJ4MFP_EBI_AD3               NVT_PINMUX('J', 4, SYS_GPJ_MFP1_PJ4MFP_EBI_AD3)
#define PJ4MFP_UART8_TXD             NVT_PINMUX('J', 4, SYS_GPJ_MFP1_PJ4MFP_UART8_TXD)
#define PJ4MFP_I2C3_SCL              NVT_PINMUX('J', 4, SYS_GPJ_MFP1_PJ4MFP_I2C3_SCL)
#define PJ4MFP_QSPI1_MISO0           NVT_PINMUX('J', 4, SYS_GPJ_MFP1_PJ4MFP_QSPI1_MISO0)
#define PJ4MFP_CCAP_DATA3            NVT_PINMUX('J', 4, SYS_GPJ_MFP1_PJ4MFP_CCAP_DATA3)
#define PJ4MFP_CANFD1_TXD            NVT_PINMUX('J', 4, SYS_GPJ_MFP1_PJ4MFP_CANFD1_TXD)
#define PJ4MFP_SPIM0_MISO            NVT_PINMUX('J', 4, SYS_GPJ_MFP1_PJ4MFP_SPIM0_MISO)
#define PJ5MFP_GPIO                  NVT_PINMUX('J', 5, SYS_GPJ_MFP1_PJ5MFP_GPIO)
#define PJ5MFP_EBI_AD2               NVT_PINMUX('J', 5, SYS_GPJ_MFP1_PJ5MFP_EBI_AD2)
#define PJ5MFP_UART8_RXD             NVT_PINMUX('J', 5, SYS_GPJ_MFP1_PJ5MFP_UART8_RXD)
#define PJ5MFP_I2C3_SDA              NVT_PINMUX('J', 5, SYS_GPJ_MFP1_PJ5MFP_I2C3_SDA)
#define PJ5MFP_QSPI1_MOSI0           NVT_PINMUX('J', 5, SYS_GPJ_MFP1_PJ5MFP_QSPI1_MOSI0)
#define PJ5MFP_CCAP_DATA2            NVT_PINMUX('J', 5, SYS_GPJ_MFP1_PJ5MFP_CCAP_DATA2)
#define PJ5MFP_CANFD1_RXD            NVT_PINMUX('J', 5, SYS_GPJ_MFP1_PJ5MFP_CANFD1_RXD)
#define PJ5MFP_SPIM0_D2              NVT_PINMUX('J', 5, SYS_GPJ_MFP1_PJ5MFP_SPIM0_D2)
#define PJ6MFP_GPIO                  NVT_PINMUX('J', 6, SYS_GPJ_MFP1_PJ6MFP_GPIO)
#define PJ6MFP_EBI_AD1               NVT_PINMUX('J', 6, SYS_GPJ_MFP1_PJ6MFP_EBI_AD1)
#define PJ6MFP_UART9_nCTS            NVT_PINMUX('J', 6, SYS_GPJ_MFP1_PJ6MFP_UART9_nCTS)
#define PJ6MFP_CCAP_DATA1            NVT_PINMUX('J', 6, SYS_GPJ_MFP1_PJ6MFP_CCAP_DATA1)
#define PJ6MFP_SPIM0_D3              NVT_PINMUX('J', 6, SYS_GPJ_MFP1_PJ6MFP_SPIM0_D3)
#define PJ7MFP_GPIO                  NVT_PINMUX('J', 7, SYS_GPJ_MFP1_PJ7MFP_GPIO)
#define PJ7MFP_EBI_AD0               NVT_PINMUX('J', 7, SYS_GPJ_MFP1_PJ7MFP_EBI_AD0)
#define PJ7MFP_UART9_nRTS            NVT_PINMUX('J', 7, SYS_GPJ_MFP1_PJ7MFP_UART9_nRTS)
#define PJ7MFP_CCAP_DATA0            NVT_PINMUX('J', 7, SYS_GPJ_MFP1_PJ7MFP_CCAP_DATA0)
#define PJ7MFP_SPIM0_SS              NVT_PINMUX('J', 7, SYS_GPJ_MFP1_PJ7MFP_SPIM0_SS)
#define PJ8MFP_GPIO                  NVT_PINMUX('J', 8, SYS_GPJ_MFP2_PJ8MFP_GPIO)
#define PJ8MFP_EBI_nRD               NVT_PINMUX('J', 8, SYS_GPJ_MFP2_PJ8MFP_EBI_nRD)
#define PJ8MFP_SD1_DAT3              NVT_PINMUX('J', 8, SYS_GPJ_MFP2_PJ8MFP_SD1_DAT3)
#define PJ8MFP_UART7_TXD             NVT_PINMUX('J', 8, SYS_GPJ_MFP2_PJ8MFP_UART7_TXD)
#define PJ8MFP_BPWM0_CH5             NVT_PINMUX('J', 8, SYS_GPJ_MFP2_PJ8MFP_BPWM0_CH5)
#define PJ9MFP_GPIO                  NVT_PINMUX('J', 9, SYS_GPJ_MFP2_PJ9MFP_GPIO)
#define PJ9MFP_EBI_nWR               NVT_PINMUX('J', 9, SYS_GPJ_MFP2_PJ9MFP_EBI_nWR)
#define PJ9MFP_SD1_DAT2              NVT_PINMUX('J', 9, SYS_GPJ_MFP2_PJ9MFP_SD1_DAT2)
#define PJ9MFP_UART7_RXD             NVT_PINMUX('J', 9, SYS_GPJ_MFP2_PJ9MFP_UART7_RXD)
#define PJ9MFP_BPWM0_CH4             NVT_PINMUX('J', 9, SYS_GPJ_MFP2_PJ9MFP_BPWM0_CH4)
#define PJ10MFP_GPIO                 NVT_PINMUX('J', 10, SYS_GPJ_MFP2_PJ10MFP_GPIO)
#define PJ10MFP_EBI_MCLK             NVT_PINMUX('J', 10, SYS_GPJ_MFP2_PJ10MFP_EBI_MCLK)
#define PJ10MFP_SD1_DAT1             NVT_PINMUX('J', 10, SYS_GPJ_MFP2_PJ10MFP_SD1_DAT1)
#define PJ10MFP_UART6_TXD            NVT_PINMUX('J', 10, SYS_GPJ_MFP2_PJ10MFP_UART6_TXD)
#define PJ10MFP_ECAP2_IC0            NVT_PINMUX('J', 10, SYS_GPJ_MFP2_PJ10MFP_ECAP2_IC0)
#define PJ10MFP_CANFD0_TXD           NVT_PINMUX('J', 10, SYS_GPJ_MFP2_PJ10MFP_CANFD0_TXD)
#define PJ10MFP_BPWM0_CH3            NVT_PINMUX('J', 10, SYS_GPJ_MFP2_PJ10MFP_BPWM0_CH3)
#define PJ11MFP_GPIO                 NVT_PINMUX('J', 11, SYS_GPJ_MFP2_PJ11MFP_GPIO)
#define PJ11MFP_EBI_ALE              NVT_PINMUX('J', 11, SYS_GPJ_MFP2_PJ11MFP_EBI_ALE)
#define PJ11MFP_SD1_DAT0             NVT_PINMUX('J', 11, SYS_GPJ_MFP2_PJ11MFP_SD1_DAT0)
#define PJ11MFP_UART6_RXD            NVT_PINMUX('J', 11, SYS_GPJ_MFP2_PJ11MFP_UART6_RXD)
#define PJ11MFP_ECAP2_IC1            NVT_PINMUX('J', 11, SYS_GPJ_MFP2_PJ11MFP_ECAP2_IC1)
#define PJ11MFP_CANFD0_RXD           NVT_PINMUX('J', 11, SYS_GPJ_MFP2_PJ11MFP_CANFD0_RXD)
#define PJ11MFP_BPWM0_CH2            NVT_PINMUX('J', 11, SYS_GPJ_MFP2_PJ11MFP_BPWM0_CH2)
#define PJ12MFP_GPIO                 NVT_PINMUX('J', 12, SYS_GPJ_MFP3_PJ12MFP_GPIO)
#define PJ12MFP_EBI_nCS0             NVT_PINMUX('J', 12, SYS_GPJ_MFP3_PJ12MFP_EBI_nCS0)
#define PJ12MFP_SD1_CMD              NVT_PINMUX('J', 12, SYS_GPJ_MFP3_PJ12MFP_SD1_CMD)
#define PJ12MFP_ECAP2_IC2            NVT_PINMUX('J', 12, SYS_GPJ_MFP3_PJ12MFP_ECAP2_IC2)
#define PJ12MFP_CANFD1_TXD           NVT_PINMUX('J', 12, SYS_GPJ_MFP3_PJ12MFP_CANFD1_TXD)
#define PJ12MFP_BPWM0_CH1            NVT_PINMUX('J', 12, SYS_GPJ_MFP3_PJ12MFP_BPWM0_CH1)
#define PJ12MFP_HSUSB_VBUS_ST        NVT_PINMUX('J', 12, SYS_GPJ_MFP3_PJ12MFP_HSUSB_VBUS_ST)
#define PJ13MFP_GPIO                 NVT_PINMUX('J', 13, SYS_GPJ_MFP3_PJ13MFP_GPIO)
#define PJ13MFP_SD1_CLK              NVT_PINMUX('J', 13, SYS_GPJ_MFP3_PJ13MFP_SD1_CLK)
#define PJ13MFP_CANFD1_RXD           NVT_PINMUX('J', 13, SYS_GPJ_MFP3_PJ13MFP_CANFD1_RXD)
#define PJ13MFP_BPWM0_CH0            NVT_PINMUX('J', 13, SYS_GPJ_MFP3_PJ13MFP_BPWM0_CH0)
#define PJ13MFP_HSUSB_VBUS_EN        NVT_PINMUX('J', 13, SYS_GPJ_MFP3_PJ13MFP_HSUSB_VBUS_EN)
